window.DAMIETTA_DATA={
    "دمياط الجديدة": {
      "الحي الاول": {
        "cafes": [
          {
            "name": "Planet Cafe East",
            "lat": 31.42843037172835,
            "lng": 31.687755386514795,
            "rate": null,
            "phone": null
          },
          {
            "name": "بن ابو سالم",
            "lat": 31.43293715091413,
            "lng": 31.684299908564505,
            "rate": null,
            "phone": "01031179564"
          },
          {
            "name": "كنوز كافيه",
            "lat": 31.43310423889911,
            "lng": 31.68375626204343,
            "rate": 4.3,
            "phone": "01017826835"
          },
          {
            "name": "الدمياطي كافيه",
            "lat": 31.433056178429197,
            "lng": 31.683231858178086,
            "rate": 3.4,
            "phone": "01018065063"
          },
          {
            "name": "Mocha Cafe",
            "lat": 31.433184339659423,
            "lng": 31.68188002484496,
            "rate": 3.9,
            "phone": "01012486028"
          },
          {
            "name": "Paulo cafe",
            "lat": 31.437936480228526,
            "lng": 31.67826175666925,
            "rate": 4.4,
            "phone": null
          },
          {
            "name": "MYANO cafe",
            "lat": 31.437057701394842,
            "lng": 31.676201820170718,
            "rate": 3.9,
            "phone": null
          },
          {
            "name": "Papaya Cafe",
            "lat": 31.439108172523248,
            "lng": 31.673283576797783,
            "rate": 4.4,
            "phone": null
          },
          {
            "name": "ENTRO COFFEE",
            "lat": 31.440353079536386,
            "lng": 31.675171851921448,
            "rate": 4.7,
            "phone": null
          },
          {
            "name": "Zayed Coffee",
            "lat": 31.440865683500018,
            "lng": 31.676287650858153,
            "rate": 4.2,
            "phone": null
          },
          {
            "name": "Cactus Cafe",
            "lat": 31.43987708763108,
            "lng": 31.680665015917548,
            "rate": 4.4,
            "phone": null
          }
        ],
        "restaurants": [
          {
            "name": "مطعم على كيفك",
            "lat": 31.429569659641093,
            "lng": 31.691910082875648,
            "rate": 4.1,
            "phone": "01007416549"
          },
          {
            "name": "مطعم ملك للاكلات البيتى",
            "lat": 31.428635667317092,
            "lng": 31.68808005616594,
            "rate": 5.0,
            "phone": "01128001890"
          },
          {
            "name": "Golden Spoon 1",
            "lat": 31.432781546620316,
            "lng": 31.683403519571645,
            "rate": 4.2,
            "phone": "01118657555"
          },
          {
            "name": "Yummy",
            "lat": 31.432131581491483,
            "lng": 31.684605149195786,
            "rate": 4.0,
            "phone": "01118275827"
          },
          {
            "name": "الشاميات",
            "lat": 31.428391905764062,
            "lng": 31.690312889970073,
            "rate": 4.0,
            "phone": "01033017071"
          },
          {
            "name": "Bahary Fish Shop & Restaurant",
            "lat": 31.429664419239522,
            "lng": 31.69075813668068,
            "rate": 3.9,
            "phone": "01027316050"
          },
          {
            "name": "مطعم وكافيه محمد أفندي",
            "lat": 31.428773854907842,
            "lng": 31.68831067352447,
            "rate": 5.0,
            "phone": null
          },
          {
            "name": "3al faa7m",
            "lat": 31.436795054684477,
            "lng": 31.676556873813535,
            "rate": 4.1,
            "phone": "0572416510"
          },
          {
            "name": "مطعم روح دمشق",
            "lat": 31.437728759538114,
            "lng": 31.67880992935881,
            "rate": 4.2,
            "phone": "0502245034"
          }
        ],
        "pharmacy": [
          {
            "name": "صيدلية الجامعة",
            "lat": 31.430181339998963,
            "lng": 31.69043761461682,
            "rate": 4.5,
            "phone": "01029291415"
          },
          {
            "name": "صيدلية دينا الحديدى",
            "lat": 31.42923353343869,
            "lng": 31.693358231068558,
            "rate": 4.8,
            "phone": "01007928267"
          },
          {
            "name": "صيدلية دكتور وائل حلمى",
            "lat": 31.43285874563925,
            "lng": 31.675076294402036,
            "rate": 3.7,
            "phone": "0572400660"
          },
          {
            "name": "Alsokkary Pharmacy",
            "lat": 31.433368990892944,
            "lng": 31.68315599266583,
            "rate": 4.1,
            "phone": "01223030103"
          },
          {
            "name": "Hany Saber Pharmacy",
            "lat": 31.434510153397262,
            "lng": 31.683422213517627,
            "rate": 4.7,
            "phone": "01000470366"
          },
          {
            "name": "صيدلية سلامة",
            "lat": 31.435910897896882,
            "lng": 31.68522237368759,
            "rate": 5.0,
            "phone": null
          },
          {
            "name": "صيدلية الزهراء",
            "lat": 31.428393143689892,
            "lng": 31.689050883310617,
            "rate": 4.0,
            "phone": "01001128124"
          },
          {
            "name": "صيدلية دراهم",
            "lat": 31.431613664931746,
            "lng": 31.685245987540203,
            "rate": 3.9,
            "phone": "01000966274"
          },
          {
            "name": "صيدلية الغباشي",
            "lat": 31.436233561476673,
            "lng": 31.682313907519923,
            "rate": 4.5,
            "phone": "01110130050"
          },
          {
            "name": "Dr. Ahmed Hassanien Pharmacy",
            "lat": 31.43501029065638,
            "lng": 31.688388773114102,
            "rate": 5.0,
            "phone": "01064133341"
          },
          {
            "name": "District 1 Neighborhood 5 Market",
            "lat": 31.433423497173752,
            "lng": 31.674571036833907,
            "rate": 3.7,
            "phone": "01012124220"
          }
        ],
        "supermarket": [
          {
            "name": "سوبر ماركت رزق",
            "lat": 31.433934557821495,
            "lng": 31.68496089566602,
            "rate": 4.5,
            "phone": "01005898263"
          },
          {
            "name": "Fathalla Market",
            "lat": 31.432067063223023,
            "lng": 31.68425279249465,
            "rate": 4.4,
            "phone": "034191200"
          },
          {
            "name": "اسواق علي",
            "lat": 31.434091761932887,
            "lng": 31.68312191951602,
            "rate": 4.1,
            "phone": "01225566510"
          },
          {
            "name": "Delta Market",
            "lat": 31.431717130734665,
            "lng": 31.690698465973334,
            "rate": null,
            "phone": null
          },
          {
            "name": "Al hakeem market",
            "lat": 31.4273228626491,
            "lng": 31.67610724910869,
            "rate": 4.2,
            "phone": null
          },
          {
            "name": "فتح الله دمياط",
            "lat": 31.431471207752374,
            "lng": 31.685279597571487,
            "rate": 4.3,
            "phone": null
          }
        ],
        "gym": [
          {
            "name": "Red Gym",
            "lat": 31.4324760178293,
            "lng": 31.683416962554737,
            "rate": 5.0,
            "phone": "01093891867"
          },
          {
            "name": "My Gym",
            "lat": 31.43442346469142,
            "lng": 31.675975596179285,
            "rate": 4.5,
            "phone": null
          }
        ],
        "clothes": [
          {
            "name": "ZEZO للملابس",
            "lat": 31.429242043429007,
            "lng": 31.691732861416988,
            "rate": 4.0,
            "phone": null
          },
          {
            "name": "M.Sou",
            "lat": 31.433581295609116,
            "lng": 31.683214165688664,
            "rate": 4.0,
            "phone": "01002591602"
          },
          {
            "name": "Men's Club",
            "lat": 31.434295330520534,
            "lng": 31.683149792673085,
            "rate": 4.1,
            "phone": "01007896116"
          }
        ],
        "bakery": [
          {
            "name": "مخبوزات الصعيدي",
            "lat": 31.438377931708583,
            "lng": 31.68142243570276,
            "rate": 3.8,
            "phone": "01155048527"
          }
        ],
        "bookstore": [
          {
            "name": "Alwafaa Bookstore",
            "lat": 31.433947152703787,
            "lng": 31.683761321126934,
            "rate": 4.2,
            "phone": "01555740076"
          }
        ],
        "hair_salon": [
          {
            "name": "صالون تامر الصنعى",
            "lat": 31.434825754726845,
            "lng": 31.682666979053355,
            "rate": 4.5,
            "phone": "01092275879"
          },
          {
            "name": "Noura Gaballah make up studio",
            "lat": 31.436089026790178,
            "lng": 31.68247386000662,
            "rate": 3.8,
            "phone": "01000059642"
          },
          {
            "name": "Not a Barber",
            "lat": 31.426584952866758,
            "lng": 31.675472259362742,
            "rate": 4.7,
            "phone": "01284848347"
          },
          {
            "name": "الباز صالون",
            "lat": 31.42706101226965,
            "lng": 31.67959213235982,
            "rate": 4.6,
            "phone": "01007331545"
          }
        ]
      },
      "الحي الثاني": {
        "cafes": [
          {
            "name": "CASSATA CAFE",
            "lat": 31.45048234553541,
            "lng": 31.682746396865863,
            "rate": 4.8,
            "phone": "01278999681"
          },
          {
            "name": "NEFERTITI CAfee",
            "lat": 31.448798237694156,
            "lng": 31.682317243428667,
            "rate": 4.3,
            "phone": "01203040888"
          },
          {
            "name": "La Pesca",
            "lat": 31.446926008219712,
            "lng": 31.68180564610216,
            "rate": 4.1,
            "phone": "01061000854"
          },
          {
            "name": "كافيه شارع10",
            "lat": 31.449415597991102,
            "lng": 31.683093106413743,
            "rate": 4.1,
            "phone": null
          },
          {
            "name": "Shaheen Cafe",
            "lat": 31.446340212776875,
            "lng": 31.686526333911306,
            "rate": 4.2,
            "phone": "01068999823"
          },
          {
            "name": "GORDO CAFE",
            "lat": 31.44780469451671,
            "lng": 31.690045392096305,
            "rate": 4.8,
            "phone": "01003299595"
          },
          {
            "name": "Trend",
            "lat": 31.451392578033918,
            "lng": 31.67081931810996,
            "rate": 4.5,
            "phone": "01096823889"
          },
          {
            "name": "ام كلثوم كافيه",
            "lat": 31.448610149716245,
            "lng": 31.690302884158626,
            "rate": 4.1,
            "phone": "01065680114"
          },
          {
            "name": "Zayed Coffee",
            "lat": 31.440848202387702,
            "lng": 31.67682746623069,
            "rate": 4.2,
            "phone": "01003219497"
          },
          {
            "name": "MYANO cafe",
            "lat": 31.438870999852618,
            "lng": 31.676655804855812,
            "rate": 3.9,
            "phone": "01001223343"
          },
          {
            "name": "Yaba Cafe",
            "lat": 31.437333146820272,
            "lng": 31.676398312793495,
            "rate": 3.5,
            "phone": "01555755092"
          },
          {
            "name": "ENTRO COFFEE",
            "lat": 31.441067888983355,
            "lng": 31.675625836606542,
            "rate": 4.7,
            "phone": null
          },
          {
            "name": "قهوه تامر",
            "lat": 31.453575034706585,
            "lng": 31.688205391412687,
            "rate": 4.2,
            "phone": "01062760208"
          },
          {
            "name": "carbucks cafe",
            "lat": 31.450824705258437,
            "lng": 31.68279805788719,
            "rate": 5.0,
            "phone": null
          }
        ],
        "restaurants": [
          {
            "name": "Ezz Syrian Restaurant",
            "lat": 31.443937898142508,
            "lng": 31.68331343651903,
            "rate": 3.9,
            "phone": "01026007215"
          },
          {
            "name": "shaheen again restaurant",
            "lat": 31.445841768753596,
            "lng": 31.686145849204518,
            "rate": 4.0,
            "phone": "01095528335"
          },
          {
            "name": "Habayebna fast food",
            "lat": 31.444670160647856,
            "lng": 31.682798452394398,
            "rate": 4.1,
            "phone": "01003329276"
          },
          {
            "name": "Al Hayy Ath Thani",
            "lat": 31.447708178126174,
            "lng": 31.682422548751415,
            "rate": null,
            "phone": null
          },
          {
            "name": "Alhay Alsharqy",
            "lat": 31.447927848639086,
            "lng": 31.681220919127266,
            "rate": null,
            "phone": null
          },
          {
            "name": "Abo Saleh Restaurant",
            "lat": 31.446097245293885,
            "lng": 31.682250887376536,
            "rate": 4.1,
            "phone": "01017929100"
          },
          {
            "name": "Mandoo",
            "lat": 31.446390144232662,
            "lng": 31.67774477628599,
            "rate": 4.7,
            "phone": "01091978759"
          },
          {
            "name": "يامال الشام",
            "lat": 31.44880652554019,
            "lng": 31.68298044821977,
            "rate": 4.2,
            "phone": "01225760251"
          },
          {
            "name": "XYZ Restaurant - New Damietta",
            "lat": 31.454700770007516,
            "lng": 31.691906839713432,
            "rate": 2.6,
            "phone": null
          },
          {
            "name": "مطعم عم بيومي",
            "lat": 31.4546641609381,
            "lng": 31.691735178338558,
            "rate": 4.5,
            "phone": "01090286492"
          },
          {
            "name": "Al-Saidi",
            "lat": 31.442884449957862,
            "lng": 31.68303409239942,
            "rate": 3.9,
            "phone": null
          },
          {
            "name": "Restaurant Albesh",
            "lat": 31.44619792940734,
            "lng": 31.682014852986075,
            "rate": 4.0,
            "phone": "01010566144"
          },
          {
            "name": "بيت عمورة",
            "lat": 31.445438219333905,
            "lng": 31.68155351304109,
            "rate": null,
            "phone": null
          },
          {
            "name": "مطعم البيك الدمشقي",
            "lat": 31.447808860575417,
            "lng": 31.682261616197557,
            "rate": 4.1,
            "phone": "01272000079"
          },
          {
            "name": "Butterfly",
            "lat": 31.448307694432796,
            "lng": 31.68183246274766,
            "rate": 5.0,
            "phone": null
          },
          {
            "name": "مطعم روك",
            "lat": 31.447094928620636,
            "lng": 31.680947333788108,
            "rate": 4.2,
            "phone": "01060837469"
          },
          {
            "name": "شيخ الكار",
            "lat": 31.44725968263055,
            "lng": 31.68271759173924,
            "rate": 3.9,
            "phone": null
          },
          {
            "name": "KFC | Damietta El Gedida",
            "lat": 31.446463368880643,
            "lng": 31.682347446904327,
            "rate": 3.3,
            "phone": "0219019"
          },
          {
            "name": "Hamborghini - burger restaurant",
            "lat": 31.450270968822302,
            "lng": 31.678388506412865,
            "rate": 4.8,
            "phone": "01023966751"
          },
          {
            "name": "Lavita Square Food Court",
            "lat": 31.450147407127027,
            "lng": 31.68144622452384,
            "rate": 4.0,
            "phone": "01098055012"
          },
          {
            "name": "3al faa7m",
            "lat": 31.437071618728442,
            "lng": 31.676950057867,
            "rate": 4.1,
            "phone": "0572416510"
          }
        ],
        "pharmacy": [
          {
            "name": "دمياط الجديده",
            "lat": 31.45345321394504,
            "lng": 31.690091626605355,
            "rate": 5.0,
            "phone": null
          },
          {
            "name": "صيدلية د. شيرين رمزي",
            "lat": 31.450890510399017,
            "lng": 31.685199277421333,
            "rate": 1.6,
            "phone": "01065949203"
          },
          {
            "name": "Hegazy Pharmacy",
            "lat": 31.448986742380228,
            "lng": 31.686143414983153,
            "rate": 4.7,
            "phone": "01220580300"
          },
          {
            "name": "صيدلية الدياسطي",
            "lat": 31.4492064098953,
            "lng": 31.68271018748559,
            "rate": 4.8,
            "phone": null
          },
          {
            "name": "صيدلية الزهراء الجديدة",
            "lat": 31.44672133867629,
            "lng": 31.68260792608838,
            "rate": 3.8,
            "phone": "01014014646"
          },
          {
            "name": "Alzayat pharmacy",
            "lat": 31.444990885733656,
            "lng": 31.68306430471748,
            "rate": 3.2,
            "phone": null
          },
          {
            "name": "Bialy Pharmacy",
            "lat": 31.4435848691857,
            "lng": 31.682988241612627,
            "rate": 4.3,
            "phone": "01120052007"
          },
          {
            "name": "صيدلية التمامي دمياط الجديدة",
            "lat": 31.44152988397354,
            "lng": 31.68210083872271,
            "rate": 3.7,
            "phone": "01222167350"
          }
        ],
        "supermarket": [
          {
            "name": "Star Cairo",
            "lat": 31.442920132246318,
            "lng": 31.683763932166,
            "rate": 4.2,
            "phone": "0572402152"
          },
          {
            "name": "سوبر ماركت نجم",
            "lat": 31.445849179746862,
            "lng": 31.683678101478563,
            "rate": 3.7,
            "phone": "01068490642"
          },
          {
            "name": "سوبر ماركت",
            "lat": 31.445414920955574,
            "lng": 31.676534414059493,
            "rate": 4.6,
            "phone": null
          },
          {
            "name": "سوبر ماركت الجامعه الجديد",
            "lat": 31.443767335366754,
            "lng": 31.675461530466503,
            "rate": 2.8,
            "phone": null
          },
          {
            "name": "سوبر ماركت قشطة",
            "lat": 31.446513295253443,
            "lng": 31.67477488496699,
            "rate": 4.0,
            "phone": null
          },
          {
            "name": "ماركت التوتنجي",
            "lat": 31.450796831982416,
            "lng": 31.68537497486572,
            "rate": 4.1,
            "phone": null
          },
          {
            "name": "Alkawas Market",
            "lat": 31.451053105748194,
            "lng": 31.675976514591138,
            "rate": 4.5,
            "phone": "01025318428"
          },
          {
            "name": "سوبر ماركت الامانى",
            "lat": 31.451968363474347,
            "lng": 31.689366101831634,
            "rate": 4.3,
            "phone": "01060652691"
          },
          {
            "name": "Zahran Market Damietta",
            "lat": 31.437140087406597,
            "lng": 31.678680181245472,
            "rate": 4.0,
            "phone": "0219866"
          }
        ],
        "gym": [
          {
            "name": "Olympia sports club",
            "lat": 31.45078982806822,
            "lng": 31.678979670316426,
            "rate": 4.4,
            "phone": "01027411154"
          },
          {
            "name": "Zahra fitness gym",
            "lat": 31.449728114919036,
            "lng": 31.683614527438134,
            "rate": 4.0,
            "phone": null
          },
          {
            "name": "fit gym studio",
            "lat": 31.44851994394026,
            "lng": 31.682584559188868,
            "rate": 2.0,
            "phone": "01010975006"
          },
          {
            "name": "Gym Egypt",
            "lat": 31.44646967874712,
            "lng": 31.67764929466112,
            "rate": 5.0,
            "phone": "01092520552"
          },
          {
            "name": "Fitness Map Gym",
            "lat": 31.441563504914047,
            "lng": 31.67855051687923,
            "rate": 4.3,
            "phone": "01113335467"
          },
          {
            "name": "Ghanem Gym",
            "lat": 31.451192543701254,
            "lng": 31.67709139519276,
            "rate": 3.7,
            "phone": "01026664626"
          },
          {
            "name": "Elite gym",
            "lat": 31.45174169859262,
            "lng": 31.678593432222943,
            "rate": 5.0,
            "phone": "01003819211"
          },
          {
            "name": "MC2 Gym&cafe",
            "lat": 31.446579515497877,
            "lng": 31.671383654401293,
            "rate": 4.2,
            "phone": "01020958589"
          },
          {
            "name": "Ji Moustafa FITNESS",
            "lat": 31.44024538456431,
            "lng": 31.676104342210444,
            "rate": 4.4,
            "phone": null
          },
          {
            "name": "Oxygen Gym",
            "lat": 31.439622932409513,
            "lng": 31.675803934804403,
            "rate": 4.1,
            "phone": "01005518038"
          },
          {
            "name": "Al-Ghamry Gym",
            "lat": 31.437499241003742,
            "lng": 31.67588976549185,
            "rate": 4.4,
            "phone": null
          },
          {
            "name": "Power Time Gym",
            "lat": 31.437316161905454,
            "lng": 31.6784217707713,
            "rate": 4.0,
            "phone": null
          },
          {
            "name": "X1 gym",
            "lat": 31.43965954735657,
            "lng": 31.680395876582402,
            "rate": 5.0,
            "phone": "01030082697"
          },
          {
            "name": "Motiv8 gym",
            "lat": 31.438561092721734,
            "lng": 31.68176916758142,
            "rate": 4.7,
            "phone": null
          }
        ],
        "hotel": [
          {
            "name": "Point 11 residence",
            "lat": 31.448730027148777,
            "lng": 31.682646832904727,
            "rate": 4.3,
            "phone": null
          },
          {
            "name": "Paradise Residence",
            "lat": 31.440455486347492,
            "lng": 31.675780377909604,
            "rate": 4.0,
            "phone": null
          },
          {
            "name": "Lamar Azur Hotel",
            "lat": 31.43701364802677,
            "lng": 31.66685398641594,
            "rate": 4.3,
            "phone": null
          }
        ],
        "clothes": [
          {
            "name": "new eid",
            "lat": 31.44997150994916,
            "lng": 31.681960174468372,
            "rate": 4.3,
            "phone": null
          },
          {
            "name": "Chifon",
            "lat": 31.448175521229416,
            "lng": 31.683163881654504,
            "rate": 5.0,
            "phone": null
          },
          {
            "name": "شركة قطنيات المحلة للملابس الجاهزة",
            "lat": 31.447634766511044,
            "lng": 31.682910337971673,
            "rate": 4.5,
            "phone": null
          },
          {
            "name": "بيت الرياضة",
            "lat": 31.446423464616046,
            "lng": 31.682530022447423,
            "rate": 3.7,
            "phone": null
          },
          {
            "name": "Hero store",
            "lat": 31.445147254607118,
            "lng": 31.68313852728622,
            "rate": 4.7,
            "phone": null
          },
          {
            "name": "Cottonil New Damietta",
            "lat": 31.443222091367307,
            "lng": 31.68313852728622,
            "rate": 3.8,
            "phone": null
          },
          {
            "name": "Tycoon",
            "lat": 31.44837090862485,
            "lng": 31.68217546451832,
            "rate": 4.3,
            "phone": null
          },
          {
            "name": "TOUCH men's wear",
            "lat": 31.448325835761832,
            "lng": 31.682182571624622,
            "rate": 5.0,
            "phone": null
          }
        ],
        "bakery": [
          {
            "name": "مخبز الاخوة بالنوعية",
            "lat": 31.44691788707212,
            "lng": 31.69010513207585,
            "rate": 3.8,
            "phone": null
          },
          {
            "name": "مخبوزات الصعيدي",
            "lat": 31.44413532585861,
            "lng": 31.683303050096306,
            "rate": 3.7,
            "phone": null
          },
          {
            "name": "نابولي",
            "lat": 31.444632736865817,
            "lng": 31.682765871501175,
            "rate": 4.4,
            "phone": null
          },
          {
            "name": "مخبزالامانه",
            "lat": 31.4451453174194,
            "lng": 31.6746977868819,
            "rate": 5.0,
            "phone": null
          },
          {
            "name": "فرن عيش سوري",
            "lat": 31.451881829795354,
            "lng": 31.685855776248978,
            "rate": 5.0,
            "phone": null
          },
          {
            "name": "مخبوزات الصعيدي",
            "lat": 31.439140626401862,
            "lng": 31.680877596377517,
            "rate": null,
            "phone": null
          }
        ],
        "bookstore": [
          {
            "name": "مكتبة ألفابيتكا",
            "lat": 31.44946552780788,
            "lng": 31.68199339531422,
            "rate": 4.9,
            "phone": "01000832265"
          },
          {
            "name": "مكتبتي",
            "lat": 31.4488797482433,
            "lng": 31.67418280275727,
            "rate": 5.0,
            "phone": null
          }
        ],
        "hair_salon": [
          {
            "name": "Nesma ebrahim beauty center",
            "lat": 31.438485712819777,
            "lng": 31.678476333383685,
            "rate": 5.0,
            "phone": "01070172168"
          },
          {
            "name": "Heba Beauty",
            "lat": 31.437936480232775,
            "lng": 31.676802634978625,
            "rate": null,
            "phone": "01096729765"
          },
          {
            "name": "Spa Hair Style Beauty Center",
            "lat": 31.440133391269363,
            "lng": 31.674399375730328,
            "rate": 4.1,
            "phone": "01095909825"
          },
          {
            "name": "Basma",
            "lat": 31.451803617713345,
            "lng": 31.689698695622923,
            "rate": 5.0,
            "phone": "01096036353"
          },
          {
            "name": "حلو ولبن",
            "lat": 31.442029931780553,
            "lng": 31.68080445625944,
            "rate": 3.9,
            "phone": null
          },
          {
            "name": "Basma",
            "lat": 31.451965598082786,
            "lng": 31.689614497396654,
            "rate": 5.0,
            "phone": null
          },
          {
            "name": "هيام",
            "lat": 31.449476076076188,
            "lng": 31.682662211714092,
            "rate": null,
            "phone": "01140919604"
          },
          {
            "name": "Spa Hair Style Beauty Center",
            "lat": 31.440908685964406,
            "lng": 31.674765788373207,
            "rate": null,
            "phone": null
          }
        ]
      },
      "الحي الثالث": {
        "cafes": [
          {
            "name": "ليالى زمان",
            "lat": 31.439456841989504,
            "lng": 31.6704759953602,
            "rate": 3.9,
            "phone": "01000421623"
          },
          {
            "name": "half moon cafe",
            "lat": 31.44128757506398,
            "lng": 31.66403869380227,
            "rate": 4.3,
            "phone": "01065324870"
          },
          {
            "name": "128cafe and bakery",
            "lat": 31.443264726614952,
            "lng": 31.663695371052512,
            "rate": 4.0,
            "phone": null
          },
          {
            "name": "Q CAFFEE",
            "lat": 31.4405552860319,
            "lng": 31.657236611752186,
            "rate": 4.7,
            "phone": "01014990504"
          }
        ],
        "restaurants": [
          {
            "name": "Sedar restaurant &cafe",
            "lat": 31.439514030785574,
            "lng": 31.659316251587743,
            "rate": null,
            "phone": null
          },
          {
            "name": "مطعم باب الحارة دمياط الجديدة",
            "lat": 31.4476422076005,
            "lng": 31.672105023931092,
            "rate": 4.1,
            "phone": null
          },
          {
            "name": "Mono Sushi",
            "lat": 31.44167429072853,
            "lng": 31.668156812188542,
            "rate": 4.3,
            "phone": null
          },
          {
            "name": "Out & About Restaurant",
            "lat": 31.44299239095816,
            "lng": 31.664122769878908,
            "rate": 4.4,
            "phone": null
          },
          {
            "name": "مطعم سلطان العرب",
            "lat": 31.439623875715036,
            "lng": 31.65843648677887,
            "rate": 4.4,
            "phone": null
          },
          {
            "name": "مطعم الحديدى ـ دمياط الجديدة",
            "lat": 31.43911126497023,
            "lng": 31.65321154365677,
            "rate": 3.4,
            "phone": null
          },
          {
            "name": "اسماك حسونه دمياط الجديده",
            "lat": 31.444310472671948,
            "lng": 31.660700271175127,
            "rate": null,
            "phone": null
          }
        ],
        "pharmacy": [
          {
            "name": "صيدليه دكتوره لبني مصطفي",
            "lat": 31.441681305333972,
            "lng": 31.65915513542661,
            "rate": 4.3,
            "phone": "01013636366"
          },
          {
            "name": "Khaled Eissa pharmacy",
            "lat": 31.43995075931462,
            "lng": 31.67355641661154,
            "rate": 5.0,
            "phone": "01554457443"
          },
          {
            "name": "صيدلية دكتور/ محمد نبيل جمعه",
            "lat": 31.44377954952047,
            "lng": 31.66477112788184,
            "rate": 5.0,
            "phone": "01044567647"
          },
          {
            "name": "مخزن الدكتور طارق قنديل لتجارة الادوية",
            "lat": 31.443152244327056,
            "lng": 31.664847190986688,
            "rate": 5.0,
            "phone": "01018302408"
          },
          {
            "name": "صيدلية الدكتورة دعاء المرسي",
            "lat": 31.441097249626637,
            "lng": 31.667420659418006,
            "rate": 1.0,
            "phone": null
          },
          {
            "name": "صيدلية د/ وليد بركات الأرشل",
            "lat": 31.44041584669899,
            "lng": 31.664023174068035,
            "rate": 5.0,
            "phone": "01044949905"
          },
          {
            "name": "صيدلية د/محمدسميربدران الجديدة",
            "lat": 31.439464037459754,
            "lng": 31.652879929118633,
            "rate": 4.5,
            "phone": "01000917593"
          },
          {
            "name": "صيدلية د/ علي الأباصيري",
            "lat": 31.438106013542747,
            "lng": 31.66068537946873,
            "rate": null,
            "phone": "01027471571"
          }
        ],
        "supermarket": [
          {
            "name": "الشويحي للالبان",
            "lat": 31.444105804470723,
            "lng": 31.667899307321523,
            "rate": 4.8,
            "phone": null
          },
          {
            "name": "Hyper Market Elsonbaty",
            "lat": 31.446156121393773,
            "lng": 31.665324386535463,
            "rate": 4.0,
            "phone": null
          },
          {
            "name": "سوبر ماركت الامارات",
            "lat": 31.443666445010894,
            "lng": 31.655453857479973,
            "rate": 3.9,
            "phone": "01097820034"
          }
        ],
        "gym": [
          {
            "name": "B.FIT GYM",
            "lat": 31.43766401186917,
            "lng": 31.66739252728754,
            "rate": 5.0,
            "phone": "0572276655"
          }
        ],
        "hotel": [
          {
            "name": "Lamar Azur Hotel",
            "lat": 31.4376344009101,
            "lng": 31.668241023558764,
            "rate": 4.3,
            "phone": null
          }
        ],
        "clothes": [
          {
            "name": "Saint Martin",
            "lat": 31.444927540097925,
            "lng": 31.665281765443098,
            "rate": 3.2,
            "phone": null
          },
          {
            "name": "Style",
            "lat": 31.440533891298973,
            "lng": 31.672148220438224,
            "rate": null,
            "phone": "01018616771"
          },
          {
            "name": "Astila Store",
            "lat": 31.43452890480488,
            "lng": 31.666290276020508,
            "rate": 5.0,
            "phone": null
          }
        ],
        "bakery": [
          {
            "name": "مخبز الطاحونة",
            "lat": 31.441726119651893,
            "lng": 31.66850924461071,
            "rate": 4.9,
            "phone": "01552887476"
          },
          {
            "name": "مخبوزات الجندي",
            "lat": 31.445094559301502,
            "lng": 31.667479276361444,
            "rate": 4.8,
            "phone": "01000078226"
          },
          {
            "name": "128cafe and bakery",
            "lat": 31.442908664010506,
            "lng": 31.66423913341667,
            "rate": 4.0,
            "phone": null
          }
        ],
        "bookstore": [],
        "hair_salon": [
          {
            "name": "House of Beauty Salon",
            "lat": 31.44762996255965,
            "lng": 31.670472621636574,
            "rate": 5.0,
            "phone": "01153220227"
          },
          {
            "name": "Hair Cut Salon",
            "lat": 31.44492064829052,
            "lng": 31.668326854450598,
            "rate": 5.0,
            "phone": "01155033038"
          },
          {
            "name": "Shaher beauty salon",
            "lat": 31.444993874030573,
            "lng": 31.66755437826364,
            "rate": 2.5,
            "phone": "01062277772"
          },
          {
            "name": "Venus salon",
            "lat": 31.438052715262206,
            "lng": 31.674164973382684,
            "rate": 5.0,
            "phone": null
          }
        ]
      },
      "الحي الرابع": {
        "cafes": [
          {
            "name": "Milano cafe",
            "lat": 31.4239391168929,
            "lng": 31.665837764509668,
            "rate": 4.1,
            "phone": "01200141778"
          },
          {
            "name": "سيدار كافيه",
            "lat": 31.426649037753066,
            "lng": 31.665022373055248,
            "rate": 4.1,
            "phone": null
          },
          {
            "name": "Abou Abdo cafe",
            "lat": 31.428924029045053,
            "lng": 31.659373640899723,
            "rate": 3.7,
            "phone": "01020088392"
          },
          {
            "name": "كافيه بريكا",
            "lat": 31.43121269691723,
            "lng": 31.666561961014764,
            "rate": 4.8,
            "phone": "01014126886"
          },
          {
            "name": "كافيه اورو شارع المرور",
            "lat": 31.43013245262585,
            "lng": 31.665381789062483,
            "rate": 4.9,
            "phone": null
          },
          {
            "name": "Royal",
            "lat": 31.42987841038092,
            "lng": 31.663517653906315,
            "rate": null,
            "phone": "01152893238"
          },
          {
            "name": "كافية كوكبة",
            "lat": 31.426958018690907,
            "lng": 31.668195426379526,
            "rate": 4.1,
            "phone": "01065823089"
          },
          {
            "name": "كافيه قصر الشام",
            "lat": 31.424312193468083,
            "lng": 31.66067451235183,
            "rate": 3.9,
            "phone": "01010052909"
          },
          {
            "name": "Abou Abdo caf",
            "lat": 31.428761531519786,
            "lng": 31.659505069219133,
            "rate": 3.7,
            "phone": "01020088392"
          },
          {
            "name": "كافيه ايزيس",
            "lat": 31.43000657594978,
            "lng": 31.659204661813096,
            "rate": 3.9,
            "phone": "01095314596"
          },
          {
            "name": "قهوه الفناجيلى",
            "lat": 31.42253107001819,
            "lng": 31.661914973166287,
            "rate": 5.0,
            "phone": null
          }
        ],
        "restaurants": [
          {
            "name": "Saidi Restaurant",
            "lat": 31.43166329001439,
            "lng": 31.65897381051997,
            "rate": null,
            "phone": null
          }
        ],
        "pharmacy": [
          {
            "name": "صيدلية سالي",
            "lat": 31.42635946044596,
            "lng": 31.670288650525347,
            "rate": 4.8,
            "phone": "01013415623"
          },
          {
            "name": "صيدليات آل مغاوري - فرع الصعيدي الجديد",
            "lat": 31.42940996859191,
            "lng": 31.65976658759337,
            "rate": 4.3,
            "phone": "01050050510"
          }
        ],
        "supermarket": [
          {
            "name": "سوبر ماركت العدوي دمياط الجديدة",
            "lat": 31.431583252490196,
            "lng": 31.656655486979624,
            "rate": 3.7,
            "phone": null
          },
          {
            "name": "سوبر ماركت المشد",
            "lat": 31.42499176371911,
            "lng": 31.667727645659262,
            "rate": 5.0,
            "phone": null
          },
          {
            "name": "سوبر ماركت حواس",
            "lat": 31.422428281836368,
            "lng": 31.66086119066414,
            "rate": 3.9,
            "phone": null
          }
        ],
        "gym": [
          {
            "name": "Twins Gym",
            "lat": 31.425049047554783,
            "lng": 31.66116980240775,
            "rate": 4.8,
            "phone": null
          }
        ],
        "hotel": [
          {
            "name": "Lamar Azur Hotel",
            "lat": 31.436860343464797,
            "lng": 31.669024537951863,
            "rate": 4.3,
            "phone": null
          }
        ],
        "clothes": [
          {
            "name": "ملوكة لملابس الاطفال",
            "lat": 31.428177911220136,
            "lng": 31.66765093782164,
            "rate": 4.5,
            "phone": null
          },
          {
            "name": "La vostra",
            "lat": 31.425955543497423,
            "lng": 31.67096078387427,
            "rate": 4.8,
            "phone": null
          }
        ],
        "bakery": [
          {
            "name": "حلواني ومخبوزات سويت لاند",
            "lat": 31.425577896040085,
            "lng": 31.675670742884325,
            "rate": 3.6,
            "phone": null
          },
          {
            "name": "مخبوزات ابن البلد",
            "lat": 31.429752533304104,
            "lng": 31.673288941307895,
            "rate": 3.7,
            "phone": null
          },
          {
            "name": "Fourth neighborhood bakery",
            "lat": 31.426420162348204,
            "lng": 31.66037142270696,
            "rate": 4.0,
            "phone": null
          },
          {
            "name": "قصر نابولي دمياط الجديده",
            "lat": 31.43125389251242,
            "lng": 31.658552884942207,
            "rate": 5.0,
            "phone": "01055460060"
          }
        ],
        "bookstore": [
          {
            "name": "Mix store",
            "lat": 31.430938475585464,
            "lng": 31.67298117313312,
            "rate": 4.9,
            "phone": "01013797787"
          },
          {
            "name": "مكتبة هاني",
            "lat": 31.427056850484664,
            "lng": 31.65366926845933,
            "rate": 5.0,
            "phone": "01095960704"
          },
          {
            "name": "مكتبة نور الدين الحديثة",
            "lat": 31.425534409173988,
            "lng": 31.670038104006085,
            "rate": null,
            "phone": null
          }
        ],
        "hair_salon": [
          {
            "name": "ELNANA VIP - HAIR CUT",
            "lat": 31.429660986233277,
            "lng": 31.67186737029214,
            "rate": 4.8,
            "phone": "01096871792"
          },
          {
            "name": "Dream Style",
            "lat": 31.424424345073433,
            "lng": 31.65804862961445,
            "rate": 5.0,
            "phone": "01221367416"
          }
        ]
      },
      "الحي الخامس": {
        "cafes": [
          {
            "name": "حدوتة مصرية كافيه",
            "lat": 31.433819471537298,
            "lng": 31.646878706846636,
            "rate": null,
            "phone": null
          },
          {
            "name": "Treats",
            "lat": 31.434946182666298,
            "lng": 31.64978919482106,
            "rate": null,
            "phone": null
          }
        ],
        "restaurants": [
          {
            "name": "Texas",
            "lat": 31.436778690501793,
            "lng": 31.651158173099184,
            "rate": 4.8,
            "phone": "01515111199"
          },
          {
            "name": "مطعم استاكوزا",
            "lat": 31.441007750640612,
            "lng": 31.652102310661014,
            "rate": 4.0,
            "phone": null
          },
          {
            "name": "اسماك السواح",
            "lat": 31.432860689622945,
            "lng": 31.64675935036793,
            "rate": 3.7,
            "phone": "01011197140"
          },
          {
            "name": "أسماك الأخطبوط",
            "lat": 31.432988851050187,
            "lng": 31.649141151960965,
            "rate": null,
            "phone": "01015464214"
          },
          {
            "name": "اسماك البهيج دمياط الجديده",
            "lat": 31.432073407934897,
            "lng": 31.65248854877109,
            "rate": null,
            "phone": null
          },
          {
            "name": "مطعم كشرى الزعيم ـ مجاورة ٢٨",
            "lat": 31.43408625978817,
            "lng": 31.647304466718268,
            "rate": 3.0,
            "phone": "01061522114"
          },
          {
            "name": "Cheesy",
            "lat": 31.43362654936799,
            "lng": 31.64663257595876,
            "rate": 4.8,
            "phone": "01004093889"
          },
          {
            "name": "مطعم ومطبخ الجود",
            "lat": 31.434600051119276,
            "lng": 31.647380529823113,
            "rate": 5.0,
            "phone": null
          },
          {
            "name": "ALMIRA",
            "lat": 31.434994857281346,
            "lng": 31.647703798018732,
            "rate": 4.1,
            "phone": "01062660473"
          }
        ],
        "pharmacy": [
          {
            "name": "Dr. Mohamed Gamal Behery's Pharmacy",
            "lat": 31.433226864855147,
            "lng": 31.64710267308241,
            "rate": 4.6,
            "phone": "01016384498"
          },
          {
            "name": "صيدلية د/ رشا أيوب",
            "lat": 31.433318408442553,
            "lng": 31.652510006391076,
            "rate": 4.0,
            "phone": "01552423004"
          },
          {
            "name": "صيدلية رضوان",
            "lat": 31.438426398949506,
            "lng": 31.643047173100914,
            "rate": 5.0,
            "phone": "01000160087"
          },
          {
            "name": "احمد حلمي",
            "lat": 31.44027545951254,
            "lng": 31.64864762549341,
            "rate": 4.8,
            "phone": "01014040282"
          },
          {
            "name": "صيدليه دكتوره نهال ابو الخير",
            "lat": 31.44126405118247,
            "lng": 31.644913990587987,
            "rate": null,
            "phone": null
          }
        ],
        "supermarket": [
          {
            "name": "El Hayat market",
            "lat": 31.434146484087353,
            "lng": 31.64850157167291,
            "rate": 3.5,
            "phone": null
          }
        ],
        "gym": [
          {
            "name": "Wadi Degla Club Damietta",
            "lat": 31.434998031158436,
            "lng": 31.648821830522817,
            "rate": 4.4,
            "phone": null
          }
        ],
        "hotel": [],
        "clothes": [
          {
            "name": "نورسين. لانچيري. ملابس أطفال",
            "lat": 31.435355043905172,
            "lng": 31.646772622837013,
            "rate": 2.0,
            "phone": null
          }
        ],
        "bakery": [],
        "bookstore": [],
        "hair_salon": [
          {
            "name": "صالون شياكة 💈",
            "lat": 31.435089573011606,
            "lng": 31.64680480911694,
            "rate": 4.9,
            "phone": "01016076289"
          }
        ]
      },
      "دمياط القديمة": {
        "فارسكور": {
          "cafes": [
            {
              "name": "Caffe elshamy",
              "lat": 31.337431772130724,
              "lng": 31.71348884188273,
              "rate": null,
              "phone": null
            },
            {
              "name": "Cafeteria Bride of the Nile",
              "lat": 31.33523245719472,
              "lng": 31.71263053498676,
              "rate": 4.3,
              "phone": null
            },
            {
              "name": "Hepta Cafe",
              "lat": 31.333399655483046,
              "lng": 31.713059688434747,
              "rate": 3.8,
              "phone": null
            },
            {
              "name": "Najjar cafe",
              "lat": 31.33229995732278,
              "lng": 31.71451881015789,
              "rate": 3.8,
              "phone": null
            },
            {
              "name": "كافيه 90",
              "lat": 31.33530576852073,
              "lng": 31.715977931881042,
              "rate": 4.1,
              "phone": null
            },
            {
              "name": "Dessouky Shalabi Coffee",
              "lat": 31.33273983812888,
              "lng": 31.71889617532733,
              "rate": 4.1,
              "phone": null
            },
            {
              "name": "Friends Caffe",
              "lat": 31.335452391001404,
              "lng": 31.718295360500157,
              "rate": 4.1,
              "phone": null
            },
            {
              "name": "Cafe Saber Deeb",
              "lat": 31.327387815330596,
              "lng": 31.715119624985068,
              "rate": 3.7,
              "phone": null
            },
            {
              "name": "Elsokaria Cafe",
              "lat": 31.33229995732278,
              "lng": 31.71263053498676,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "Marassi",
              "lat": 31.33142018954282,
              "lng": 31.712716365676357,
              "rate": 4.3,
              "phone": null
            },
            {
              "name": "El kasr Cafe",
              "lat": 31.32938754964896,
              "lng": 31.71152286792408,
              "rate": 3.7,
              "phone": null
            },
            {
              "name": "مقهى الرشيدى",
              "lat": 31.33088985833496,
              "lng": 31.712212138984167,
              "rate": 3.6,
              "phone": null
            },
            {
              "name": "Cafe Garnell",
              "lat": 31.334117075591358,
              "lng": 31.71310173173356,
              "rate": 5.0,
              "phone": null
            }
          ],
          "restaurants": [
            {
              "name": "چيتارا كافية",
              "lat": 31.342009483867567,
              "lng": 31.714997291797395,
              "rate": null,
              "phone": null
            },
            {
              "name": "Eslam Wetch",
              "lat": 31.336438057252042,
              "lng": 31.713624000763847,
              "rate": 4.3,
              "phone": null
            },
            {
              "name": "مطعم قرين",
              "lat": 31.335228427624376,
              "lng": 31.719074249553245,
              "rate": 3.4,
              "phone": null
            },
            {
              "name": "Karem Abu Hatab Restaurant",
              "lat": 31.334971837522613,
              "lng": 31.717486381795702,
              "rate": 4.1,
              "phone": null
            },
            {
              "name": "سمكنا",
              "lat": 31.33405543859074,
              "lng": 31.716713905589327,
              "rate": 4.7,
              "phone": null
            },
            {
              "name": "Mr. Burger",
              "lat": 31.33233258429061,
              "lng": 31.712336540412604,
              "rate": 4.6,
              "phone": null
            },
            {
              "name": "ويتش فارسكور",
              "lat": 31.33137950248814,
              "lng": 31.713624000756553,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "Zembokhh Restaurant",
              "lat": 31.330646356072634,
              "lng": 31.714053154204546,
              "rate": 3.8,
              "phone": null
            },
            {
              "name": "the chef",
              "lat": 31.330096492513253,
              "lng": 31.713495254722165,
              "rate": 3.9,
              "phone": null
            },
            {
              "name": "مطعم كارم الجديد",
              "lat": 31.330976272666334,
              "lng": 31.71546936058289,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "مطعم ملك الحواوشي فارسكور",
              "lat": 31.33104958730788,
              "lng": 31.716327667478858,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "King food",
              "lat": 31.331306188103586,
              "lng": 31.715383529893295,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "كبايجي وجزاره ناجي الخضري",
              "lat": 31.329473309929366,
              "lng": 31.71628475213406,
              "rate": 4.5,
              "phone": null
            },
            {
              "name": "Gannet Al-Asmak Seafood Restaurant",
              "lat": 31.32943665200182,
              "lng": 31.716413498168453,
              "rate": 4.1,
              "phone": null
            },
            {
              "name": "مطعم غريب",
              "lat": 31.33046306857643,
              "lng": 31.7178726198916,
              "rate": 4.3,
              "phone": null
            },
            {
              "name": "مطعم و كافيه الحسن",
              "lat": 31.331599445299204,
              "lng": 31.71941757230434,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "مطعم حوزه",
              "lat": 31.326613948708957,
              "lng": 31.716198921444466,
              "rate": 5.0,
              "phone": null
            }
          ],
          "pharmacy": [
            {
              "name": "صيدلية د.أماني أبوعبدة",
              "lat": 31.337500229985757,
              "lng": 31.718945499465708,
              "rate": null,
              "phone": null
            },
            {
              "name": "Elsherbini pharmacy",
              "lat": 31.33735361069589,
              "lng": 31.71752929308736,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية آيه",
              "lat": 31.33427455283548,
              "lng": 31.718044277224937,
              "rate": 3.7,
              "phone": null
            },
            {
              "name": "Elkady pharmacy",
              "lat": 31.33339480351383,
              "lng": 31.716113086709015,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "صيدلية الديب",
              "lat": 31.332515045968233,
              "lng": 31.718301769293728,
              "rate": 4.2,
              "phone": null
            },
            {
              "name": "Health Pharmacy",
              "lat": 31.331232051472824,
              "lng": 31.718988414810504,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "صيدلية لميس مراد",
              "lat": 31.330315616125382,
              "lng": 31.718816753431312,
              "rate": 3.5,
              "phone": null
            },
            {
              "name": "4G",
              "lat": 31.329582461422852,
              "lng": 31.717357631708165,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "صيدلية بحيرى",
              "lat": 31.33108542241687,
              "lng": 31.71701430894978,
              "rate": 4.6,
              "phone": null
            },
            {
              "name": "Al-Hayat Pharmacy",
              "lat": 31.32987337811848,
              "lng": 31.717460386018832,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "صيدلية الاهرام",
              "lat": 31.33018513236324,
              "lng": 31.716365469576605,
              "rate": 4.5,
              "phone": null
            },
            {
              "name": "صيدلية الأندلس",
              "lat": 31.329757913321334,
              "lng": 31.71509482580415,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "صيدلية الإتحاد",
              "lat": 31.33048533917857,
              "lng": 31.715027238369444,
              "rate": null,
              "phone": null
            },
            {
              "name": "دار الشفاء",
              "lat": 31.329261413079617,
              "lng": 31.71750093847966,
              "rate": 3.0,
              "phone": null
            },
            {
              "name": "صيدلية الأمانة",
              "lat": 31.33090100856504,
              "lng": 31.713918804472208,
              "rate": 4.7,
              "phone": null
            },
            {
              "name": "صيدلية الإتحاد",
              "lat": 31.330658534974788,
              "lng": 31.714986685940552,
              "rate": null,
              "phone": null
            },
            {
              "name": "Huda Pharmacy",
              "lat": 31.330254410936234,
              "lng": 31.712904992951625,
              "rate": 4.5,
              "phone": null
            },
            {
              "name": "صيدليه الدكتوره ولاء تاج الدين",
              "lat": 31.329065121556145,
              "lng": 31.712999615360218,
              "rate": 3.5,
              "phone": null
            },
            {
              "name": "Amirty",
              "lat": 31.32781910661559,
              "lng": 31.710956094696538,
              "rate": null,
              "phone": null
            },
            {
              "name": "Hakim Pharmacy",
              "lat": 31.33377593496611,
              "lng": 31.715848443970785,
              "rate": 5.0,
              "phone": null
            }
          ],
          "supermarket": [
            {
              "name": "السويسى ماركت",
              "lat": 31.335751651811606,
              "lng": 31.719126328734003,
              "rate": null,
              "phone": null
            },
            {
              "name": "فوود باسكت",
              "lat": 31.335635277863563,
              "lng": 31.71769572764036,
              "rate": null,
              "phone": null
            },
            {
              "name": "الحرايرى",
              "lat": 31.333656898727924,
              "lng": 31.71790009922517,
              "rate": 4.5,
              "phone": null
            },
            {
              "name": "ماركت بيضون",
              "lat": 31.332900448655383,
              "lng": 31.717014489024333,
              "rate": null,
              "phone": null
            },
            {
              "name": "عطاره السعيد حسن",
              "lat": 31.331212961199036,
              "lng": 31.71694636516273,
              "rate": null,
              "phone": null
            },
            {
              "name": "أسواق الصياد",
              "lat": 31.331387530270014,
              "lng": 31.719194452595605,
              "rate": null,
              "phone": null
            },
            {
              "name": "Hyper Radwan",
              "lat": 31.33045649148331,
              "lng": 31.7189219571492,
              "rate": null,
              "phone": null
            },
            {
              "name": "جمعيتى",
              "lat": 31.32673224424051,
              "lng": 31.720625053689254,
              "rate": null,
              "phone": null
            },
            {
              "name": "كريم ماركت",
              "lat": 31.32946725268127,
              "lng": 31.71694636516273,
              "rate": null,
              "phone": null
            },
            {
              "name": "الفجر الجديد",
              "lat": 31.328885342646963,
              "lng": 31.715447640207486,
              "rate": 3.0,
              "phone": null
            },
            {
              "name": "سوبر ماركت غريب",
              "lat": 31.33006950688218,
              "lng": 31.718123394986687,
              "rate": null,
              "phone": null
            },
            {
              "name": "Samir essily",
              "lat": 31.33028945275446,
              "lng": 31.71447559067882,
              "rate": null,
              "phone": null
            },
            {
              "name": "Maidat Al-Madina Supermarket",
              "lat": 31.329941204886023,
              "lng": 31.71432538697203,
              "rate": null,
              "phone": null
            },
            {
              "name": "الدياسطى",
              "lat": 31.332910434842706,
              "lng": 31.715054947833607,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "Kazyon Market",
              "lat": 31.332250614058623,
              "lng": 31.71408935257564,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "زهران",
              "lat": 31.333991797791143,
              "lng": 31.713080841972875,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "Delta Market",
              "lat": 31.332837121650677,
              "lng": 31.71458287904082,
              "rate": 3.4,
              "phone": null
            }
          ],
          "gym": [
            {
              "name": "GYM",
              "lat": 31.343902112383084,
              "lng": 31.717041352622715,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "جيم شحاتة N",
              "lat": 31.33115941392216,
              "lng": 31.721401279765256,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "City Gym",
              "lat": 31.327609770569033,
              "lng": 31.71636011400669,
              "rate": 4.2,
              "phone": null
            },
            {
              "name": "I Forma gym",
              "lat": 31.32912274967824,
              "lng": 31.71622386628349,
              "rate": null,
              "phone": null
            },
            {
              "name": "X gym",
              "lat": 31.33011199210095,
              "lng": 31.71860820143956,
              "rate": null,
              "phone": null
            },
            {
              "name": "جم طاهر",
              "lat": 31.349836478756043,
              "lng": 31.713498911819393,
              "rate": null,
              "phone": null
            }
          ],
          "clothes": [
            {
              "name": "الشيطى للملابس والمفروشات",
              "lat": 31.330097631436324,
              "lng": 31.716450788119317,
              "rate": null,
              "phone": null
            },
            {
              "name": "سنتر مليكة",
              "lat": 31.33007967793344,
              "lng": 31.71638994578123,
              "rate": null,
              "phone": null
            },
            {
              "name": "محل سمارت SMART, للملابس الحريمي",
              "lat": 31.330019202951153,
              "lng": 31.71636450262167,
              "rate": null,
              "phone": null
            },
            {
              "name": "Tota 2",
              "lat": 31.32996723223218,
              "lng": 31.71689217162658,
              "rate": null,
              "phone": null
            },
            {
              "name": "تيتو",
              "lat": 31.330253543291125,
              "lng": 31.716959651310646,
              "rate": null,
              "phone": null
            }
          ],
          "bookstore": [
            {
              "name": "سنتر آل مجد للأدوات المكتبية",
              "lat": 31.331379193593918,
              "lng": 31.71779731704724,
              "rate": null,
              "phone": null
            },
            {
              "name": "مكتبة اجيال",
              "lat": 31.33293711077009,
              "lng": 31.720071830264377,
              "rate": null,
              "phone": null
            },
            {
              "name": "دار ابن رجب للنشر والتوزيع",
              "lat": 31.336566350293793,
              "lng": 31.719567775612727,
              "rate": null,
              "phone": null
            }
          ],
          "bakery": [
            {
              "name": "فرن العراقي",
              "lat": 31.337647465629203,
              "lng": 31.71909570600318,
              "rate": null,
              "phone": null
            },
            {
              "name": "الفرن الآلى بفارسكور",
              "lat": 31.33253399094985,
              "lng": 31.714267729834734,
              "rate": null,
              "phone": null
            },
            {
              "name": "الفيروز",
              "lat": 31.33117768222805,
              "lng": 31.71830177214437,
              "rate": null,
              "phone": null
            },
            {
              "name": "العبد",
              "lat": 31.330462863009725,
              "lng": 31.71637058167699,
              "rate": null,
              "phone": null
            },
            {
              "name": "فطائر وائل بيتزا",
              "lat": 31.332149094515128,
              "lng": 31.71265840444525,
              "rate": null,
              "phone": null
            },
            {
              "name": "مخبوزات الصعيدي",
              "lat": 31.32991299829115,
              "lng": 31.71789407637021,
              "rate": null,
              "phone": null
            },
            {
              "name": "sharshera bakery",
              "lat": 31.3303162326682,
              "lng": 31.713151930889207,
              "rate": null,
              "phone": null
            },
            {
              "name": "المؤسسة",
              "lat": 31.330059629173576,
              "lng": 31.71261548909271,
              "rate": null,
              "phone": null
            },
            {
              "name": "المؤسسة للمخبوزات",
              "lat": 31.32811675144303,
              "lng": 31.715211867387744,
              "rate": null,
              "phone": null
            },
            {
              "name": "فرن شرشيرة",
              "lat": 31.327841812676148,
              "lng": 31.7154479017782,
              "rate": null,
              "phone": null
            },
            {
              "name": "حلوانى فشور",
              "lat": 31.329638064770883,
              "lng": 31.718065737745093,
              "rate": null,
              "phone": null
            }
          ],
          "hair_salon": [
            {
              "name": "Class Lady",
              "lat": 31.33608787867755,
              "lng": 31.713795431220493,
              "rate": null,
              "phone": null
            },
            {
              "name": "Bakar Hairdressing Women",
              "lat": 31.330296156097386,
              "lng": 31.71190715609684,
              "rate": null,
              "phone": null
            },
            {
              "name": "Night life Hairdressing",
              "lat": 31.328243308115,
              "lng": 31.709933050285734,
              "rate": null,
              "phone": null
            },
            {
              "name": "mr Lotfy center",
              "lat": 31.330442786382935,
              "lng": 31.715769537031594,
              "rate": null,
              "phone": null
            },
            {
              "name": "سنتر فايف ستار",
              "lat": 31.33366859487078,
              "lng": 31.71439624603257,
              "rate": null,
              "phone": null
            }
          ]
        },
        "كفر سعد": {
          "cafes": [
            {
              "name": "Family Lounge",
              "lat": 31.3588992243317,
              "lng": 31.68525032263679,
              "rate": null,
              "phone": null
            },
            {
              "name": "Zuma Cafe & Ps",
              "lat": 31.357323413541124,
              "lng": 31.684434931106114,
              "rate": null,
              "phone": null
            },
            {
              "name": "النادى الإجتماعى Elassal Café",
              "lat": 31.356993589335538,
              "lng": 31.686666528979526,
              "rate": null,
              "phone": null
            },
            {
              "name": "قهوة الديب",
              "lat": 31.35589416696096,
              "lng": 31.687310259135323,
              "rate": null,
              "phone": null
            },
            {
              "name": "فنجان قهوة",
              "lat": 31.354941323837977,
              "lng": 31.68756775119764,
              "rate": null,
              "phone": null
            },
            {
              "name": "Abu Hamed Coffee",
              "lat": 31.354098416103653,
              "lng": 31.687267343791603,
              "rate": null,
              "phone": null
            },
            {
              "name": "Raba3 Caffe",
              "lat": 31.354135064423126,
              "lng": 31.68649486760465,
              "rate": null,
              "phone": null
            },
            {
              "name": "مكاوي كافيه",
              "lat": 31.352449226944483,
              "lng": 31.686065714167455,
              "rate": null,
              "phone": null
            },
            {
              "name": "كافتيريا سهر الليالي",
              "lat": 31.352998959877848,
              "lng": 31.682632486669892,
              "rate": null,
              "phone": null
            },
            {
              "name": "گافيه احمد هويدي",
              "lat": 31.351642946162592,
              "lng": 31.68228916392014,
              "rate": null,
              "phone": null
            },
            {
              "name": "OREO",
              "lat": 31.3546847875013,
              "lng": 31.683962862325195,
              "rate": null,
              "phone": null
            },
            {
              "name": "Antique Khan cafe",
              "lat": 31.356223995023132,
              "lng": 31.68525032263679,
              "rate": null,
              "phone": null
            },
            {
              "name": "كافى شوب عش البلبل",
              "lat": 31.35593081458056,
              "lng": 31.68490699988703,
              "rate": null,
              "phone": null
            },
            {
              "name": "قعدة عرب كافيه",
              "lat": 31.35512456364995,
              "lng": 31.68756775119764,
              "rate": null,
              "phone": null
            },
            {
              "name": "Champions PlayStation",
              "lat": 31.35540283857616,
              "lng": 31.684849433169425,
              "rate": null,
              "phone": null
            }
          ],
          "restaurants": [
            {
              "name": "مطعم وكافيه أهل الشام",
              "lat": 31.35901765688649,
              "lng": 31.686508270231197,
              "rate": null,
              "phone": null
            },
            {
              "name": "Ben Country Grill",
              "lat": 31.356122545978515,
              "lng": 31.686722846949788,
              "rate": null,
              "phone": null
            },
            {
              "name": "مطعم الفلاح",
              "lat": 31.35480322536466,
              "lng": 31.6841050109829,
              "rate": null,
              "phone": null
            },
            {
              "name": "remontada cafe",
              "lat": 31.354839873409457,
              "lng": 31.683590026858262,
              "rate": null,
              "phone": null
            },
            {
              "name": "كربيانو",
              "lat": 31.353813722756417,
              "lng": 31.68517789457589,
              "rate": null,
              "phone": null
            },
            {
              "name": "مطعم جريلز",
              "lat": 31.35502311341914,
              "lng": 31.68517789457589,
              "rate": null,
              "phone": null
            },
            {
              "name": "الشيف رمضان",
              "lat": 31.35407026146948,
              "lng": 31.68577870938796,
              "rate": null,
              "phone": null
            },
            {
              "name": "الكابتن للمأكولات البحريه",
              "lat": 31.35571942219935,
              "lng": 31.687881561230217,
              "rate": null,
              "phone": null
            },
            {
              "name": "ستارفش للماكولات البحريه",
              "lat": 31.35506064845219,
              "lng": 31.687326571363418,
              "rate": null,
              "phone": null
            },
            {
              "name": "The Town Restaurant",
              "lat": 31.356716980925505,
              "lng": 31.68446152772733,
              "rate": null,
              "phone": null
            },
            {
              "name": "مطعم رانش برانش",
              "lat": 31.354346143095185,
              "lng": 31.684195306860353,
              "rate": null,
              "phone": null
            },
            {
              "name": "طيبة بروست",
              "lat": 31.353750717810357,
              "lng": 31.687466020368905,
              "rate": null,
              "phone": null
            }
          ],
          "pharmacy": [
            {
              "name": "صيدلية دكتور رزق رسلان",
              "lat": 31.358592959010863,
              "lng": 31.686436565754725,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية العزبي",
              "lat": 31.35738361426347,
              "lng": 31.68489161338082,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية اللضام M E",
              "lat": 31.35771343710088,
              "lng": 31.688882740346738,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية أحمد",
              "lat": 31.35679725969574,
              "lng": 31.687724026066306,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية د/ محمد نبيل",
              "lat": 31.35683390696334,
              "lng": 31.686393650411006,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدليه د. محمد صالح",
              "lat": 31.356247548967534,
              "lng": 31.685020359411975,
              "rate": null,
              "phone": null
            },
            {
              "name": "Magdy Shawareb",
              "lat": 31.35500152608546,
              "lng": 31.68407622185015,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية الدكتور مينا ماهر أنطون ناشد",
              "lat": 31.352802621897442,
              "lng": 31.683132084288317,
              "rate": null,
              "phone": null
            },
            {
              "name": "Zikry pharmacies صيدلية ذكري",
              "lat": 31.354488453040723,
              "lng": 31.685234936130577,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية دار الدواء",
              "lat": 31.354854934072616,
              "lng": 31.686221989036124,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية د عبدالله",
              "lat": 31.354744989913026,
              "lng": 31.685020359411975,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدليه د/نشات",
              "lat": 31.354048673917056,
              "lng": 31.685149105443134,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية أبو رية",
              "lat": 31.354341860228033,
              "lng": 31.686651142473316,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية الحياة",
              "lat": 31.354928230107614,
              "lng": 31.686994465223076,
              "rate": null,
              "phone": null
            }
          ],
          "supermarket": [
            {
              "name": "اسلامكو ماركت",
              "lat": 31.359031894089153,
              "lng": 31.684891610113556,
              "rate": null,
              "phone": null
            },
            {
              "name": "سوبرماركت قشطة",
              "lat": 31.35650325822717,
              "lng": 31.687895684173924,
              "rate": null,
              "phone": null
            },
            {
              "name": "Super Market Mamoon",
              "lat": 31.35522059085153,
              "lng": 31.686994461955816,
              "rate": null,
              "phone": null
            },
            {
              "name": "Market son Tutu",
              "lat": 31.35459757467012,
              "lng": 31.686307816456303,
              "rate": null,
              "phone": null
            },
            {
              "name": "Kazyon",
              "lat": 31.354927407280357,
              "lng": 31.687724022799046,
              "rate": null,
              "phone": null
            },
            {
              "name": "ماركت ومنتجات ألبان لؤلؤة دمياط",
              "lat": 31.354487630209626,
              "lng": 31.686951546612097,
              "rate": null,
              "phone": null
            },
            {
              "name": "محمد رضا البشبيشي للنقل الدولي المبرد",
              "lat": 31.353754663854474,
              "lng": 31.68690863126838,
              "rate": null,
              "phone": null
            },
            {
              "name": "البطراوى ماركت",
              "lat": 31.35503735122667,
              "lng": 31.683647065145692,
              "rate": null,
              "phone": null
            },
            {
              "name": "ماركت الشربيني الجديد",
              "lat": 31.354301105645554,
              "lng": 31.683979684901047,
              "rate": null,
              "phone": null
            },
            {
              "name": "الندى ماركت اسامة حامد",
              "lat": 31.355139518274104,
              "lng": 31.674541572423326,
              "rate": null,
              "phone": null
            }
          ],
          "gym": [
            {
              "name": "انترناشونال كاراتيه أكاديمي.. ك. سعد السيد سعد",
              "lat": 31.358599881193403,
              "lng": 31.684948999150826,
              "rate": null,
              "phone": null
            },
            {
              "name": "نادى تفتيش كفر سعد الرياضى",
              "lat": 31.353615815286116,
              "lng": 31.68391903090156,
              "rate": null,
              "phone": null
            }
          ],
          "clothes": [
            {
              "name": "Track kafr saad",
              "lat": 31.356442818963533,
              "lng": 31.684177086844656,
              "rate": null,
              "phone": null
            },
            {
              "name": "LACOSTE",
              "lat": 31.354757022858255,
              "lng": 31.68640868471807,
              "rate": null,
              "phone": null
            },
            {
              "name": "Kimo vape Store",
              "lat": 31.3538408166464,
              "lng": 31.68443457890697,
              "rate": null,
              "phone": null
            }
          ],
          "bookstore": [
            {
              "name": "مكتبة الأقصى",
              "lat": 31.35548915859259,
              "lng": 31.686752004230588,
              "rate": null,
              "phone": null
            },
            {
              "name": "مكتبة سلمي",
              "lat": 31.35548915859259,
              "lng": 31.683790845513936,
              "rate": null,
              "phone": null
            },
            {
              "name": "شارع مكتبة اسماء",
              "lat": 31.356222111427737,
              "lng": 31.678941411673627,
              "rate": null,
              "phone": null
            },
            {
              "name": "مكتبة الشافعي",
              "lat": 31.356991705755537,
              "lng": 31.685335797887838,
              "rate": null,
              "phone": null
            },
            {
              "name": "مكتبة مستر خالد",
              "lat": 31.35688176409436,
              "lng": 31.68417708360741,
              "rate": null,
              "phone": null
            },
            {
              "name": "مكتبة ايمان",
              "lat": 31.358750754850814,
              "lng": 31.6852499672004,
              "rate": null,
              "phone": null
            }
          ],
          "bakery": [],
          "hair_salon": [
            {
              "name": "كوافير الجمال المغربي",
              "lat": 31.354553149697104,
              "lng": 31.684944527161704,
              "rate": null,
              "phone": null
            },
            {
              "name": "صالون حلاقة (VIP)",
              "lat": 31.354699742180415,
              "lng": 31.684944527161704,
              "rate": null,
              "phone": null
            },
            {
              "name": "صالون ابن الحسن",
              "lat": 31.356200263023442,
              "lng": 31.68413505820027,
              "rate": null,
              "phone": null
            },
            {
              "name": "ستايل بيوتى سنتر",
              "lat": 31.352800942289537,
              "lng": 31.684413956251383,
              "rate": null,
              "phone": null
            },
            {
              "name": "صالون زكريا للرجال",
              "lat": 31.353688674846058,
              "lng": 31.686366242609203,
              "rate": null,
              "phone": null
            },
            {
              "name": "كوافير عيد للرجال",
              "lat": 31.35331870386619,
              "lng": 31.685205712352136,
              "rate": null,
              "phone": null
            }
          ]
        },
        "كفر البطيخ": {
          "cafes": [
            {
              "name": "El take cafe",
              "lat": 31.403146050120583,
              "lng": 31.739332714438785,
              "rate": null,
              "phone": null
            },
            {
              "name": "قهوة ابو سالم",
              "lat": 31.414248504853905,
              "lng": 31.746829184239264,
              "rate": null,
              "phone": null
            },
            {
              "name": "الملوك كافيه",
              "lat": 31.41302541745295,
              "lng": 31.743191191541975,
              "rate": 4.6,
              "phone": "01069803948"
            },
            {
              "name": "قهوة الحضرى",
              "lat": 31.41076736805161,
              "lng": 31.743080949339024,
              "rate": 3.4,
              "phone": null
            },
            {
              "name": "بكار كافيه",
              "lat": 31.40907379533699,
              "lng": 31.73756883919161,
              "rate": 5.0,
              "phone": "01000566471"
            },
            {
              "name": "LaCasa Club",
              "lat": 31.408321086540763,
              "lng": 31.736907385973925,
              "rate": 5.0,
              "phone": "01099866827"
            },
            {
              "name": "الساحه قهوة النادى",
              "lat": 31.403493367591157,
              "lng": 31.73636099963695,
              "rate": 4.0,
              "phone": null
            },
            {
              "name": "Cafe ghonem",
              "lat": 31.41372147881458,
              "lng": 31.729587370397322,
              "rate": 4.4,
              "phone": null
            },
            {
              "name": "Almzarath Cafe",
              "lat": 31.40125206769523,
              "lng": 31.735109344571207,
              "rate": 3.9,
              "phone": null
            },
            {
              "name": "كافي زين",
              "lat": 31.405443245742404,
              "lng": 31.732199441988048,
              "rate": 4.7,
              "phone": null
            },
            {
              "name": "مسلم كافيه",
              "lat": 31.405101963317875,
              "lng": 31.738493234444434,
              "rate": null,
              "phone": null
            },
            {
              "name": "كافيتريا الأصدقاء",
              "lat": 31.40527491545348,
              "lng": 31.73821772368356,
              "rate": 4.3,
              "phone": null
            },
            {
              "name": "كف القمر",
              "lat": 31.406795130584065,
              "lng": 31.73810092612523,
              "rate": 5.0,
              "phone": "01094243211"
            },
            {
              "name": "مقهى ليالي الحلمية",
              "lat": 31.40557397611346,
              "lng": 31.7386849139169,
              "rate": 5.0,
              "phone": null
            }
          ],
          "restaurants": [
            {
              "name": "ابوغتمة للمشويات",
              "lat": 31.40831899361034,
              "lng": 31.737310744771104,
              "rate": 4.6,
              "phone": null
            },
            {
              "name": "مطعم الطيب فول وفلافل وكشري",
              "lat": 31.406524244687933,
              "lng": 31.734821654835372,
              "rate": 4.1,
              "phone": null
            },
            {
              "name": "مطعم الحاوي",
              "lat": 31.407753328530156,
              "lng": 31.73779737375156,
              "rate": 4.5,
              "phone": null
            },
            {
              "name": "ويتش",
              "lat": 31.404426002149066,
              "lng": 31.73797240534224,
              "rate": 4.5,
              "phone": null
            },
            {
              "name": "تيمبو",
              "lat": 31.402073526434783,
              "lng": 31.736384594150604,
              "rate": 4.8,
              "phone": null
            },
            {
              "name": "مطعم تحابيش",
              "lat": 31.402175809213702,
              "lng": 31.73845174456991,
              "rate": 4.0,
              "phone": null
            },
            {
              "name": "مطعم تقاطيع للمشويات",
              "lat": 31.40411916083468,
              "lng": 31.733898021907088,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "مطعم غنيم",
              "lat": 31.40140868565492,
              "lng": 31.7277265293509,
              "rate": null,
              "phone": null
            },
            {
              "name": "مطعم السعدنى",
              "lat": 31.40450720509582,
              "lng": 31.73823011370101,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "مطعم صبا الشام",
              "lat": 31.403464831974112,
              "lng": 31.73837171041512,
              "rate": 4.9,
              "phone": null
            },
            {
              "name": "مطعم الشافعي",
              "lat": 31.405141687414634,
              "lng": 31.739522183717224,
              "rate": 4.8,
              "phone": null
            }
          ],
          "pharmacy": [
            {
              "name": "صيدلية الحديدي البيطرية",
              "lat": 31.40894490054859,
              "lng": 31.73785094531909,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "صيدلية عتمان",
              "lat": 31.4085553945264,
              "lng": 31.737293149216857,
              "rate": null,
              "phone": "01091989942"
            },
            {
              "name": "صيدلية د محمد سمير شريف",
              "lat": 31.407733098725483,
              "lng": 31.74063992583026,
              "rate": null,
              "phone": "01063592255"
            },
            {
              "name": "مركز البقري للخدمات البيطرية",
              "lat": 31.41019996451021,
              "lng": 31.738560867631023,
              "rate": 5.0,
              "phone": "01094236113"
            },
            {
              "name": "صيدلية العلم والإيمان",
              "lat": 31.40774829634972,
              "lng": 31.735986600263754,
              "rate": 4.1,
              "phone": null
            },
            {
              "name": "صيدلية",
              "lat": 31.406431066610956,
              "lng": 31.738221104200782,
              "rate": 5.0,
              "phone": "01002939772"
            },
            {
              "name": "صيدلية . سارة الحبشى",
              "lat": 31.405758756444065,
              "lng": 31.73781886691112,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "صيدلية د محمود ايمن",
              "lat": 31.40546641295871,
              "lng": 31.739580687082686,
              "rate": null,
              "phone": null
            },
            {
              "name": "Al Malah Pharmacy",
              "lat": 31.404048410038772,
              "lng": 31.73850429807875,
              "rate": 4.0,
              "phone": null
            },
            {
              "name": "elkasaby",
              "lat": 31.404667540709372,
              "lng": 31.735906924612735,
              "rate": 5.0,
              "phone": "01094033804"
            },
            {
              "name": "Dr. Moataz Elmeshad Pharmacy",
              "lat": 31.404747428240313,
              "lng": 31.739323289712186,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "صيدلية د أحمد السالوس",
              "lat": 31.40378698753479,
              "lng": 31.732656384943766,
              "rate": 5.0,
              "phone": "01055805585"
            },
            {
              "name": "ayman hegazi pharmacy",
              "lat": 31.401369445854147,
              "lng": 31.730081464320598,
              "rate": 3.0,
              "phone": null
            },
            {
              "name": "صيدلية الدكتور احمد صلاح البقري",
              "lat": 31.399904238772137,
              "lng": 31.735660459004134,
              "rate": 5.0,
              "phone": "0573667855"
            },
            {
              "name": "Dr. Ola Pharmacy",
              "lat": 31.39580153721904,
              "lng": 31.725189114940477,
              "rate": 2.2,
              "phone": null
            },
            {
              "name": "Heba Kenawy Pharmacy",
              "lat": 31.397926172935765,
              "lng": 31.735917951004193,
              "rate": 4.6,
              "phone": "01224828070"
            }
          ],
          "supermarket": [
            {
              "name": "سوبر ماركت الحمد",
              "lat": 31.40942560286144,
              "lng": 31.736977484783747,
              "rate": 4.5,
              "phone": null
            },
            {
              "name": "القدس هايبر",
              "lat": 31.407766481041413,
              "lng": 31.738099003680723,
              "rate": 4.6,
              "phone": null
            },
            {
              "name": "عطارة فتحة خير",
              "lat": 31.40763885507096,
              "lng": 31.73600550173971,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "سوبرماركت السلمي",
              "lat": 31.405844012897006,
              "lng": 31.738479170300824,
              "rate": null,
              "phone": null
            },
            {
              "name": "Bsmla market-ماركت بسمله",
              "lat": 31.404122753860356,
              "lng": 31.736462476685116,
              "rate": 5.0,
              "phone": "01091133245"
            },
            {
              "name": "Market elmahgoub",
              "lat": 31.40621396839592,
              "lng": 31.734221024011035,
              "rate": 3.5,
              "phone": null
            },
            {
              "name": "حماده هيبر",
              "lat": 31.4044242710319,
              "lng": 31.731137367971503,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "ماركت الاخلاص",
              "lat": 31.399705113371265,
              "lng": 31.73554275117511,
              "rate": 4.0,
              "phone": null
            },
            {
              "name": "بيتي ماركت",
              "lat": 31.396865313007446,
              "lng": 31.735384323440186,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "ماركت بدوى",
              "lat": 31.414949745481085,
              "lng": 31.736278925998064,
              "rate": 3.5,
              "phone": null
            }
          ],
          "gym": [
            {
              "name": "EL CLASICO",
              "lat": 31.40559122649977,
              "lng": 31.73695827598096,
              "rate": 4.7,
              "phone": "0573661613"
            },
            {
              "name": "صالة حمادة جبل للجيم",
              "lat": 31.402642606558896,
              "lng": 31.734469186002432,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "جولدن جيم",
              "lat": 31.400518077646083,
              "lng": 31.734040032565236,
              "rate": 3.7,
              "phone": null
            },
            {
              "name": "Muscle zone",
              "lat": 31.40117741935146,
              "lng": 31.732323418816453,
              "rate": 5.0,
              "phone": "01556549536"
            },
            {
              "name": "نادى كفر البطيخ",
              "lat": 31.412898276657305,
              "lng": 31.744683037718456,
              "rate": 3.7,
              "phone": null
            }
          ],
          "clothes": [],
          "bookstore": [
            {
              "name": "مكتب ابو زغلول للنقل",
              "lat": 31.40949142402985,
              "lng": 31.73685125420663,
              "rate": 3.7,
              "phone": "01015494561"
            },
            {
              "name": "مكتب حكايه للملابس الجاهزه",
              "lat": 31.402622762963762,
              "lng": 31.736465406403706,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "Kindergarten Library",
              "lat": 31.399752831036565,
              "lng": 31.7351976210698,
              "rate": 4.1,
              "phone": "01063454825"
            }
          ],
          "bakery": [
            {
              "name": "حلواني فتحي (حلويات - مخبوزات - كحك وصباحيات عرائس)",
              "lat": 31.40587761045321,
              "lng": 31.7351711562899,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "مخبز الجوجري",
              "lat": 31.40194747846053,
              "lng": 31.737100082576635,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "مشلتت الصعيدي",
              "lat": 31.404588423095454,
              "lng": 31.739173682976542,
              "rate": 3.7,
              "phone": null
            },
            {
              "name": "مخبز العوادلي",
              "lat": 31.40306944982122,
              "lng": 31.736558663686154,
              "rate": 4.6,
              "phone": null
            },
            {
              "name": "مخبز شطا",
              "lat": 31.404206550465208,
              "lng": 31.732620108232723,
              "rate": 3.0,
              "phone": null
            },
            {
              "name": "مخبز الأصدقاء",
              "lat": 31.410565936713024,
              "lng": 31.742952679317618,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "حلواني النور",
              "lat": 31.399585788588958,
              "lng": 31.723509982177596,
              "rate": 4.4,
              "phone": null
            },
            {
              "name": "حلواني وليد بدوي",
              "lat": 31.397747357706226,
              "lng": 31.729563995658317,
              "rate": 5.0,
              "phone": null
            }
          ],
          "hair_salon": [
            {
              "name": "H&A",
              "lat": 31.405364710114856,
              "lng": 31.738728574156443,
              "rate": 4.8,
              "phone": null
            },
            {
              "name": "كوافير ست الحسن",
              "lat": 31.405131168588014,
              "lng": 31.738865579057524,
              "rate": null,
              "phone": null
            },
            {
              "name": "كوافير ديكو",
              "lat": 31.4074419252422,
              "lng": 31.73771247192773,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "كوافير محمد حتة",
              "lat": 31.400756562229976,
              "lng": 31.735346625527583,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "صالون محمد علي",
              "lat": 31.400760119689803,
              "lng": 31.735445265112748,
              "rate": 5.0,
              "phone": "01003759589"
            },
            {
              "name": "صالون الحصي",
              "lat": 31.40122624345588,
              "lng": 31.729893090514096,
              "rate": null,
              "phone": null
            }
          ],
          "hotel": [
            {
              "name": "Casablanca Hotel",
              "lat": 31.4278477204944,
              "lng": 31.751355824085014,
              "rate": null,
              "phone": null
            }
          ]
        },
        "رأس البر": {
          "cafes": [
            {
              "name": "Hawaii restaurant & cafe",
              "lat": 31.521129086221666,
              "lng": 31.837190632811897,
              "rate": 4.2,
              "phone": null
            },
            {
              "name": "Maracanã Cafe",
              "lat": 31.521359809169525,
              "lng": 31.83718318254588,
              "rate": 3.8,
              "phone": null
            },
            {
              "name": "Al Aaem Restaurant & Café",
              "lat": 31.52173652628747,
              "lng": 31.8370409534391,
              "rate": 3.9,
              "phone": null
            },
            {
              "name": "Monkey mania kids area and cafe",
              "lat": 31.521320838228064,
              "lng": 31.83727969515405,
              "rate": 5.0,
              "phone": "01040976914"
            },
            {
              "name": "Sea Door",
              "lat": 31.52099175074805,
              "lng": 31.83704603305005,
              "rate": 4.1,
              "phone": null
            },
            {
              "name": "كافية وشاطئ الخليج",
              "lat": 31.520298930962127,
              "lng": 31.835481512875454,
              "rate": 3.9,
              "phone": null
            },
            {
              "name": "B. Labn",
              "lat": 31.518497575473546,
              "lng": 31.83901692210117,
              "rate": null,
              "phone": null
            },
            {
              "name": "قهوة العلمين بسوق ٦٣ راس البر",
              "lat": 31.5116728943521,
              "lng": 31.826988403256472,
              "rate": 4.4,
              "phone": null
            },
            {
              "name": "Cafeteria Afifi Road 77",
              "lat": 31.514998689492238,
              "lng": 31.81756064532121,
              "rate": 3.8,
              "phone": null
            },
            {
              "name": "ليالينا كافيه",
              "lat": 31.507484495871985,
              "lng": 31.821132183312056,
              "rate": 4.1,
              "phone": null
            },
            {
              "name": "RasElbar Cafe",
              "lat": 31.50473573085319,
              "lng": 31.819493993783965,
              "rate": 4.0,
              "phone": null
            },
            {
              "name": "مطعم و كافيه الشباب",
              "lat": 31.50543247416763,
              "lng": 31.82103232805607,
              "rate": 3.9,
              "phone": null
            },
            {
              "name": "Princess cafe",
              "lat": 31.503307771646377,
              "lng": 31.81981320719424,
              "rate": 4.1,
              "phone": null
            },
            {
              "name": "Rokna cafe",
              "lat": 31.505824425275197,
              "lng": 31.830324401569367,
              "rate": 4.7,
              "phone": null
            },
            {
              "name": "Moussimo Cafe & Restaurant",
              "lat": 31.49185593913684,
              "lng": 31.825055682164813,
              "rate": 4.0,
              "phone": null
            },
            {
              "name": "blue house cafe",
              "lat": 31.489118152083872,
              "lng": 31.82431476849855,
              "rate": 4.1,
              "phone": null
            },
            {
              "name": "Soltana sea coffee",
              "lat": 31.515509888635098,
              "lng": 31.8265375092834,
              "rate": 4.0,
              "phone": null
            }
          ],
          "restaurants": [
            {
              "name": "McDonald's - Ras Al Bar",
              "lat": 31.524223993396163,
              "lng": 31.840973019615564,
              "rate": null,
              "phone": null
            },
            {
              "name": "Nile Street Food Court",
              "lat": 31.51914046037985,
              "lng": 31.839497020671477,
              "rate": 4.1,
              "phone": null
            },
            {
              "name": "مدينة رأس البر",
              "lat": 31.514671070218704,
              "lng": 31.833445362922205,
              "rate": 4.3,
              "phone": null
            },
            {
              "name": "El Kilany Restaurant - Ras Elbar",
              "lat": 31.514364589918195,
              "lng": 31.834194330465433,
              "rate": 4.0,
              "phone": null
            },
            {
              "name": "Banadora Ras El Bar branch",
              "lat": 31.514007028296138,
              "lng": 31.83620156348128,
              "rate": 4.0,
              "phone": null
            },
            {
              "name": "راس البر",
              "lat": 31.51377716645659,
              "lng": 31.8247872979925,
              "rate": null,
              "phone": null
            },
            {
              "name": "El Ayoty Restaurant",
              "lat": 31.508643439730392,
              "lng": 31.82598564606166,
              "rate": 4.1,
              "phone": null
            },
            {
              "name": "El Matboly Restaurant",
              "lat": 31.506651171226423,
              "lng": 31.827723250725374,
              "rate": null,
              "phone": null
            },
            {
              "name": "Golden spoon",
              "lat": 31.50121052965383,
              "lng": 31.825266637183592,
              "rate": 4.2,
              "phone": null
            },
            {
              "name": "Bomb fried chicken",
              "lat": 31.50256433390894,
              "lng": 31.826375109147566,
              "rate": 4.4,
              "phone": null
            },
            {
              "name": "Maraj Restaurant and Café",
              "lat": 31.493931705314434,
              "lng": 31.825540014879074,
              "rate": 4.4,
              "phone": null
            },
            {
              "name": "KFC | Ras ELBar",
              "lat": 31.493276607467934,
              "lng": 31.823187205628255,
              "rate": 3.5,
              "phone": null
            },
            {
              "name": "El Mohamady",
              "lat": 31.48914119705227,
              "lng": 31.824339601980085,
              "rate": 4.4,
              "phone": null
            },
            {
              "name": "Camp Cafe and Resturant",
              "lat": 31.488158498220454,
              "lng": 31.823475304746392,
              "rate": null,
              "phone": null
            }
          ],
          "pharmacy": [
            {
              "name": "صيدليه جوده",
              "lat": 31.52279755281299,
              "lng": 31.84034592599584,
              "rate": null,
              "phone": null
            },
            {
              "name": "Drahem Pharmacy",
              "lat": 31.518188054107757,
              "lng": 31.8382859894973,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية والى راس البر",
              "lat": 31.51705545843781,
              "lng": 31.8379883902623,
              "rate": null,
              "phone": null
            },
            {
              "name": "Kamel Moustafa Pharmacy صيدليه كامل مصطفى",
              "lat": 31.514293753448776,
              "lng": 31.83587564428452,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية الريدي",
              "lat": 31.513413193107514,
              "lng": 31.834232396452265,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية دكتور خالد النجدي",
              "lat": 31.513265454118056,
              "lng": 31.834421652340648,
              "rate": 4.5,
              "phone": null
            },
            {
              "name": "صيدلية المسلماني",
              "lat": 31.513445268801483,
              "lng": 31.82908396511963,
              "rate": 4.3,
              "phone": null
            },
            {
              "name": "صيدلية زهرة",
              "lat": 31.508822617180883,
              "lng": 31.8256736098481,
              "rate": null,
              "phone": null
            },
            {
              "name": "Gomhoria pharmacy",
              "lat": 31.50799492284006,
              "lng": 31.826200631943944,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدليه الدكتوره امانى",
              "lat": 31.50548814669514,
              "lng": 31.831054782826676,
              "rate": null,
              "phone": null
            },
            {
              "name": "Dr Mohamed Darwish Pharmacy",
              "lat": 31.504021887978876,
              "lng": 31.82894669444332,
              "rate": null,
              "phone": null
            },
            {
              "name": "عبد الله جعفر",
              "lat": 31.50350159709973,
              "lng": 31.83111025883677,
              "rate": null,
              "phone": null
            },
            {
              "name": "ElHyah Pharmacy",
              "lat": 31.505771936048305,
              "lng": 31.821734813131823,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية شعيب",
              "lat": 31.5039745889277,
              "lng": 31.819626724748463,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية دعوة الحق",
              "lat": 31.501420404626597,
              "lng": 31.82656122600952,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية د/ محمد البرش",
              "lat": 31.496642946676786,
              "lng": 31.814522931820324,
              "rate": null,
              "phone": null
            },
            {
              "name": "Omar elroos Pharmacy",
              "lat": 31.493006500712514,
              "lng": 31.822759621858722,
              "rate": null,
              "phone": null
            }
          ],
          "supermarket": [
            {
              "name": "هايبر ماركت الرحمه",
              "lat": 31.51824410084496,
              "lng": 31.843423758476238,
              "rate": null,
              "phone": null
            },
            {
              "name": "فاره ماركت",
              "lat": 31.514945211962633,
              "lng": 31.834493646331875,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "صادق ماركت",
              "lat": 31.51453918681999,
              "lng": 31.834076907765134,
              "rate": 4.2,
              "phone": null
            },
            {
              "name": "سوبر ماركت زغلول",
              "lat": 31.5132607907555,
              "lng": 31.834326868841668,
              "rate": 4.4,
              "phone": null
            },
            {
              "name": "Hyper City",
              "lat": 31.51277271205703,
              "lng": 31.834112176864405,
              "rate": 3.8,
              "phone": null
            },
            {
              "name": "Kaka Market",
              "lat": 31.510655262726278,
              "lng": 31.83915725577132,
              "rate": null,
              "phone": null
            },
            {
              "name": "Abou Ammar Supermarket",
              "lat": 31.515658061892807,
              "lng": 31.82780243564062,
              "rate": 4.3,
              "phone": null
            },
            {
              "name": "سوق ٦٣",
              "lat": 31.509557051452525,
              "lng": 31.825321550570045,
              "rate": 4.3,
              "phone": null
            },
            {
              "name": "Abou Essam Market",
              "lat": 31.50854474940379,
              "lng": 31.826013241387937,
              "rate": 4.1,
              "phone": null
            },
            {
              "name": "Ellethey market",
              "lat": 31.507978969996604,
              "lng": 31.825706855759744,
              "rate": 4.2,
              "phone": null
            },
            {
              "name": "سوبر ماركت أبو علي",
              "lat": 31.507518343214148,
              "lng": 31.825810755881445,
              "rate": 4.0,
              "phone": null
            },
            {
              "name": "Eladawy supermarket",
              "lat": 31.508191566207508,
              "lng": 31.8267250769525,
              "rate": 3.9,
              "phone": null
            },
            {
              "name": "سوبر ماركت أبو وائل",
              "lat": 31.505410060892984,
              "lng": 31.82371197342292,
              "rate": 3.9,
              "phone": null
            },
            {
              "name": "قنال",
              "lat": 31.504648232896557,
              "lng": 31.828117338583407,
              "rate": null,
              "phone": null
            },
            {
              "name": "عابد زقزوق",
              "lat": 31.50581264239633,
              "lng": 31.820372967412812,
              "rate": 4.5,
              "phone": null
            },
            {
              "name": "تعاون شركة غزل المحلة",
              "lat": 31.508553979860785,
              "lng": 31.81892086772947,
              "rate": 3.9,
              "phone": null
            },
            {
              "name": "سرسوبة",
              "lat": 31.502092757488338,
              "lng": 31.840646851747913,
              "rate": 4.3,
              "phone": null
            },
            {
              "name": "Smoking",
              "lat": 31.496274711327825,
              "lng": 31.813774899845495,
              "rate": 4.8,
              "phone": null
            }
          ],
          "gym": [
            {
              "name": "وبغا",
              "lat": 31.52506538181773,
              "lng": 31.84209511479758,
              "rate": null,
              "phone": null
            },
            {
              "name": "DUMBO DOOR",
              "lat": 31.52265096947647,
              "lng": 31.83728859630099,
              "rate": null,
              "phone": null
            },
            {
              "name": "Gym El home",
              "lat": 31.51782195758307,
              "lng": 31.83720276561355,
              "rate": null,
              "phone": null
            },
            {
              "name": "COAST GYM",
              "lat": 31.51599272123197,
              "lng": 31.836001135989402,
              "rate": null,
              "phone": null
            },
            {
              "name": "Legend gum",
              "lat": 31.514039631504442,
              "lng": 31.834333123883784,
              "rate": 4.0,
              "phone": null
            },
            {
              "name": "جيم تايجر",
              "lat": 31.514278247163467,
              "lng": 31.834146525583275,
              "rate": 4.5,
              "phone": null
            },
            {
              "name": "My house in rad el bar",
              "lat": 31.516505297265322,
              "lng": 31.82668259356328,
              "rate": 1.0,
              "phone": null
            },
            {
              "name": "Master gym",
              "lat": 31.5131647022084,
              "lng": 31.83787849159328,
              "rate": 4.8,
              "phone": null
            },
            {
              "name": "Focus Gym",
              "lat": 31.507626659905277,
              "lng": 31.82973070027567,
              "rate": 5.0,
              "phone": null
            },
            {
              "name": "Ras El-Bar Stadium",
              "lat": 31.505997468158334,
              "lng": 31.83100809004118,
              "rate": 3.9,
              "phone": null
            },
            {
              "name": "Eagles Gym",
              "lat": 31.50418827256979,
              "lng": 31.816260810241484,
              "rate": 4.3,
              "phone": null
            },
            {
              "name": "Endy gym",
              "lat": 31.493567022369284,
              "lng": 31.824035233902478,
              "rate": 5.0,
              "phone": null
            }
          ],
          "hotel": [
            {
              "name": "Steigenberger Hotel El Lessan",
              "lat": 31.525958730008668,
              "lng": 31.841175482066504,
              "rate": 4.6,
              "phone": null
            },
            {
              "name": "GRAND HOTEL RAS-ELBAR",
              "lat": 31.522593200586208,
              "lng": 31.83954469900516,
              "rate": 4.5,
              "phone": null
            },
            {
              "name": "Omar Elkhayam Hotel",
              "lat": 31.513447127779614,
              "lng": 31.83542482600808,
              "rate": 4.3,
              "phone": null
            },
            {
              "name": "فندق أراكان هوتاك رأس البر",
              "lat": 31.511089572454914,
              "lng": 31.835147514674254,
              "rate": 4.6,
              "phone": null
            },
            {
              "name": "Emirates Hotel",
              "lat": 31.511713171951858,
              "lng": 31.834273821589733,
              "rate": 3.6,
              "phone": null
            },
            {
              "name": "Dolphin Inn",
              "lat": 31.510290469181204,
              "lng": 31.83396441714029,
              "rate": 4.2,
              "phone": null
            },
            {
              "name": "Aqua Marina Hotel",
              "lat": 31.510836529029675,
              "lng": 31.83259505842727,
              "rate": 3.9,
              "phone": null
            },
            {
              "name": "elmena city hotel",
              "lat": 31.510614219830966,
              "lng": 31.830659314676673,
              "rate": 4.2,
              "phone": null
            },
            {
              "name": "Teba Hotel",
              "lat": 31.510191486211028,
              "lng": 31.83141613664986,
              "rate": null,
              "phone": null
            },
            {
              "name": "Dubai Hotel",
              "lat": 31.511993653080204,
              "lng": 31.823143289563617,
              "rate": 4.0,
              "phone": null
            },
            {
              "name": "AL MINA GRAND HOTEL",
              "lat": 31.5107254652026,
              "lng": 31.821812326783178,
              "rate": 4.4,
              "phone": null
            },
            {
              "name": "Elmena beach",
              "lat": 31.510242772839206,
              "lng": 31.822014019540934,
              "rate": 4.1,
              "phone": null
            },
            {
              "name": "EL Shat'a Hotel",
              "lat": 31.509892701842983,
              "lng": 31.82095395681404,
              "rate": 4.2,
              "phone": null
            }
          ],
          "clothes": [
            {
              "name": "Hassan Mall",
              "lat": 31.512963686707238,
              "lng": 31.834658392517692,
              "rate": null,
              "phone": null
            },
            {
              "name": "Ras El-Bar City center",
              "lat": 31.514664199243857,
              "lng": 31.832973212411687,
              "rate": null,
              "phone": null
            }
          ],
          "bakery": [
            {
              "name": "Deepoint",
              "lat": 31.52365417061759,
              "lng": 31.8391246140685,
              "rate": null,
              "phone": null
            },
            {
              "name": "Rokn Elnil - Elgamal Pastry",
              "lat": 31.514848481064526,
              "lng": 31.83402225714713,
              "rate": null,
              "phone": null
            },
            {
              "name": "Bakery leader",
              "lat": 31.50992698717149,
              "lng": 31.839389556710024,
              "rate": null,
              "phone": null
            },
            {
              "name": "بيتزا وحلواني جلال سيد بلبول",
              "lat": 31.51278922734736,
              "lng": 31.834863857640986,
              "rate": null,
              "phone": null
            },
            {
              "name": "Balboul Sweets",
              "lat": 31.513232112778965,
              "lng": 31.834822297592304,
              "rate": null,
              "phone": null
            },
            {
              "name": "El Badry Pastry",
              "lat": 31.513736999610746,
              "lng": 31.834915807701833,
              "rate": null,
              "phone": null
            },
            {
              "name": "فطير و بيتزا دعدور",
              "lat": 31.513611501597747,
              "lng": 31.83516956547876,
              "rate": null,
              "phone": null
            },
            {
              "name": "حلواني سيد سيد بلبول",
              "lat": 31.512591642187438,
              "lng": 31.83475366887538,
              "rate": null,
              "phone": null
            }
          ],
          "bookstore": [],
          "hair_salon": []
        },
        "مركز الزرقا": {
          "cafes": [
            {
              "name": "Cafe alomraa",
              "lat": 31.23873531175334,
              "lng": 31.655099210944787,
              "rate": 4.4,
              "phone": null
            },
            {
              "name": "كافيه ستيشن",
              "lat": 31.234919847596093,
              "lng": 31.627107988359985,
              "rate": 3.5,
              "phone": null
            },
            {
              "name": "Lavita cafe",
              "lat": 31.212891737886093,
              "lng": 31.63776469511349,
              "rate": null,
              "phone": null
            },
            {
              "name": "تربيانو",
              "lat": 31.210569477288622,
              "lng": 31.63832931730931,
              "rate": null,
              "phone": null
            },
            {
              "name": "كافيه ومطعم يوريكا",
              "lat": 31.210289160810213,
              "lng": 31.63598589014745,
              "rate": null,
              "phone": null
            },
            {
              "name": "Al Gohary Cafe Shop",
              "lat": 31.21029229329831,
              "lng": 31.637789962864858,
              "rate": 3.8,
              "phone": null
            },
            {
              "name": "Kalmosh Cafe Shop",
              "lat": 31.206878802699855,
              "lng": 31.63689136419653,
              "rate": 3.8,
              "phone": null
            },
            {
              "name": "كافيه ومطعم النيل",
              "lat": 31.209763994239353,
              "lng": 31.631880481246117,
              "rate": null,
              "phone": null
            },
            {
              "name": "Alhaddad Coffee",
              "lat": 31.20980355488441,
              "lng": 31.63112498551643,
              "rate": null,
              "phone": null
            },
            {
              "name": "Nagib Cafe",
              "lat": 31.209076606467356,
              "lng": 31.63155228041524,
              "rate": null,
              "phone": null
            },
            {
              "name": "كافيه الواحه",
              "lat": 31.209067605272526,
              "lng": 31.630994495727332,
              "rate": null,
              "phone": null
            },
            {
              "name": "Camp cafe",
              "lat": 31.208698555546864,
              "lng": 31.63056300191216,
              "rate": null,
              "phone": null
            },
            {
              "name": "كوفى شوب البركه",
              "lat": 31.208205052152923,
              "lng": 31.63014016791088,
              "rate": null,
              "phone": null
            },
            {
              "name": "Nile Corner",
              "lat": 31.20680342641035,
              "lng": 31.621290862544402,
              "rate": null,
              "phone": null
            },
            {
              "name": "Altayyar Cafe",
              "lat": 31.202193447707106,
              "lng": 31.620918020742693,
              "rate": null,
              "phone": null
            },
            {
              "name": "Cafe ANsr",
              "lat": 31.20223743630087,
              "lng": 31.6209694486855,
              "rate": null,
              "phone": null
            },
            {
              "name": "كافيه العمدة",
              "lat": 31.200064785284518,
              "lng": 31.62764579803602,
              "rate": null,
              "phone": null
            },
            {
              "name": "كافيه ومطعم الساحل",
              "lat": 31.19744466198723,
              "lng": 31.604032029209034,
              "rate": null,
              "phone": null
            }
          ],
          "restaurants": [
            {
              "name": "Bakoat Restaurant",
              "lat": 31.213315665752585,
              "lng": 31.633919372448645,
              "rate": null,
              "phone": null
            },
            {
              "name": "Pizza Wael",
              "lat": 31.210713529874344,
              "lng": 31.634444506560182,
              "rate": null,
              "phone": null
            },
            {
              "name": "مطعم بيتزا هوم",
              "lat": 31.210609263604177,
              "lng": 31.634932149212005,
              "rate": null,
              "phone": null
            },
            {
              "name": "Baraka Restaurant",
              "lat": 31.209876156232827,
              "lng": 31.636855898908458,
              "rate": null,
              "phone": null
            },
            {
              "name": "Sakka Restaurant",
              "lat": 31.209264443805935,
              "lng": 31.636548225448156,
              "rate": null,
              "phone": null
            },
            {
              "name": "Agha Restaurant",
              "lat": 31.2090916625837,
              "lng": 31.636413547551342,
              "rate": null,
              "phone": null
            },
            {
              "name": "Mcetkh Restaurant",
              "lat": 31.20757250744878,
              "lng": 31.634082627191486,
              "rate": null,
              "phone": null
            }
          ],
          "pharmacy": [
            {
              "name": "Mohamed Nagib Pharmacy",
              "lat": 31.211950232540065,
              "lng": 31.6361326178899,
              "rate": null,
              "phone": null
            },
            {
              "name": "Heba Salama Pharmacy",
              "lat": 31.21222951040183,
              "lng": 31.63545619968837,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية دكتور أحمد الزيات",
              "lat": 31.21118838179262,
              "lng": 31.63853892881111,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية د/شيماء كامل عماشة",
              "lat": 31.21059687715707,
              "lng": 31.63902492033313,
              "rate": null,
              "phone": null
            },
            {
              "name": "Dr/ahmed asfour",
              "lat": 31.210069315847132,
              "lng": 31.639398759965452,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية د / آلاء الإسكندراني",
              "lat": 31.20971760667215,
              "lng": 31.637566945767073,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية الإيمان",
              "lat": 31.2095897121024,
              "lng": 31.6370248783002,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية انس ابن مالك",
              "lat": 31.208438653191433,
              "lng": 31.636464118851713,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية الفلال",
              "lat": 31.2095897121024,
              "lng": 31.63541736788121,
              "rate": null,
              "phone": null
            },
            {
              "name": "Awadi Pharmacy",
              "lat": 31.209669646228768,
              "lng": 31.63429584898424,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية د. محمد غنيم",
              "lat": 31.210195489282714,
              "lng": 31.634004822803735,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية السلامة البيطرية د/أسماء مجدى بدير",
              "lat": 31.210342306346497,
              "lng": 31.633339634976085,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية د.شيماء الجندي",
              "lat": 31.20513016100672,
              "lng": 31.638296357175694,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدليه ابن سينا",
              "lat": 31.2019657491405,
              "lng": 31.626523199890844,
              "rate": null,
              "phone": null
            },
            {
              "name": "Dar Elhekma Pharmacy",
              "lat": 31.202194667439723,
              "lng": 31.620864682711943,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية البلتاجي",
              "lat": 31.200559524578058,
              "lng": 31.627134931477745,
              "rate": null,
              "phone": null
            }
          ],
          "supermarket": [
            {
              "name": "أسواق أبو أيمن",
              "lat": 31.21156060006271,
              "lng": 31.63678950038557,
              "rate": null,
              "phone": null
            },
            {
              "name": "سوبر ماركت الجزار",
              "lat": 31.209505166907974,
              "lng": 31.63554495541771,
              "rate": null,
              "phone": null
            },
            {
              "name": "سوبر ماركت مترو",
              "lat": 31.20972177404832,
              "lng": 31.634721959636828,
              "rate": null,
              "phone": null
            },
            {
              "name": "Mansour supermarket",
              "lat": 31.20907025365517,
              "lng": 31.63526154198962,
              "rate": null,
              "phone": null
            },
            {
              "name": "سوبر ماركت أولاد سلامة",
              "lat": 31.20837800831948,
              "lng": 31.634134767076432,
              "rate": null,
              "phone": null
            },
            {
              "name": "سوبر ماركت الصايغ",
              "lat": 31.208798785499987,
              "lng": 31.63183360704245,
              "rate": null,
              "phone": null
            },
            {
              "name": "ماركت العدل",
              "lat": 31.20729212307525,
              "lng": 31.63559481344282,
              "rate": null,
              "phone": null
            },
            {
              "name": "محلات صلاح ابو سرية لتجارة المواد الغذائية",
              "lat": 31.20395294772043,
              "lng": 31.626279082724647,
              "rate": null,
              "phone": null
            },
            {
              "name": "سوبر ماركت حكفه",
              "lat": 31.200138542345545,
              "lng": 31.623105068884676,
              "rate": null,
              "phone": null
            }
          ],
          "gym": [
            {
              "name": "FUNKY Gym",
              "lat": 31.226736575994853,
              "lng": 31.69051887139457,
              "rate": null,
              "phone": null
            },
            {
              "name": "Gazar Gym",
              "lat": 31.212370746711112,
              "lng": 31.63975663995855,
              "rate": null,
              "phone": null
            },
            {
              "name": "Fitness time gym",
              "lat": 31.211446760877237,
              "lng": 31.6383816350554,
              "rate": null,
              "phone": null
            },
            {
              "name": "جيم هوساHawssa Gym",
              "lat": 31.211484693986176,
              "lng": 31.639460570834043,
              "rate": null,
              "phone": null
            },
            {
              "name": "جيم",
              "lat": 31.20858149163554,
              "lng": 31.63494911398344,
              "rate": null,
              "phone": null
            },
            {
              "name": "golden gym",
              "lat": 31.208147244305422,
              "lng": 31.633788610613514,
              "rate": null,
              "phone": null
            },
            {
              "name": "جيم الكوتش",
              "lat": 31.209338317907964,
              "lng": 31.631322540912787,
              "rate": null,
              "phone": null
            },
            {
              "name": "Zarqa Sports Club",
              "lat": 31.20691893387291,
              "lng": 31.639939278480284,
              "rate": null,
              "phone": null
            },
            {
              "name": "جيم الكابتن عبد المجيد",
              "lat": 31.204896529491783,
              "lng": 31.637647284324668,
              "rate": null,
              "phone": null
            }
          ],
          "clothes": [],
          "bookstore": [
            {
              "name": "Elite Library Student Services",
              "lat": 31.206999441960704,
              "lng": 31.63439475122158,
              "rate": null,
              "phone": null
            }
          ],
          "bakery": [
            {
              "name": "Qassed Cream Bakery",
              "lat": 31.209995883355806,
              "lng": 31.633904660956652,
              "rate": null,
              "phone": null
            },
            {
              "name": "Saidi bakery",
              "lat": 31.209412759488835,
              "lng": 31.63541331533756,
              "rate": null,
              "phone": null
            },
            {
              "name": "San Stefano Sweets",
              "lat": 31.208941295010213,
              "lng": 31.636298199157125,
              "rate": null,
              "phone": null
            },
            {
              "name": "lenza sweets",
              "lat": 31.210641037487044,
              "lng": 31.63792290387503,
              "rate": null,
              "phone": null
            },
            {
              "name": "مخبز باسم حسين",
              "lat": 31.2054176439343,
              "lng": 31.634426887417007,
              "rate": null,
              "phone": null
            }
          ],
          "hair_salon": [
            {
              "name": "Beauty Silk Hair & Skin",
              "lat": 31.21172042019028,
              "lng": 31.636573818718194,
              "rate": null,
              "phone": null
            },
            {
              "name": "كوفير ستي ستا",
              "lat": 31.210095138180428,
              "lng": 31.634992632876667,
              "rate": null,
              "phone": null
            },
            {
              "name": "Salon barakat",
              "lat": 31.209809780411913,
              "lng": 31.634905595085346,
              "rate": null,
              "phone": null
            },
            {
              "name": "صالون محمد شارود",
              "lat": 31.205417643986053,
              "lng": 31.63738617103857,
              "rate": null,
              "phone": null
            },
            {
              "name": "صالون القناوى",
              "lat": 31.204238928498626,
              "lng": 31.626825590259457,
              "rate": null,
              "phone": null
            },
            {
              "name": "Mohamed Elsayed",
              "lat": 31.198652800826324,
              "lng": 31.64376238143966,
              "rate": null,
              "phone": null
            }
          ],
          "hotel": []
        },
        "شطا": {
          "cafes": [
            {
              "name": "كافيه الصحبجيه",
              "lat": 31.41289721100877,
              "lng": 31.864456388693142,
              "rate": null,
              "phone": null
            },
            {
              "name": "كافية منسي",
              "lat": 31.415811173544707,
              "lng": 31.858758330288623,
              "rate": null,
              "phone": null
            }
          ],
          "restaurants": [
            {
              "name": "شطا-واي",
              "lat": 31.411399137637424,
              "lng": 31.86552007119792,
              "rate": null,
              "phone": null
            },
            {
              "name": "مطعم المصري للمأكولات السريعه",
              "lat": 31.41290764740674,
              "lng": 31.86155054319221,
              "rate": null,
              "phone": null
            }
          ],
          "pharmacy": [
            {
              "name": "Dr. Hany El-Ghadban Pharmacy",
              "lat": 31.4109955732661,
              "lng": 31.86705772068446,
              "rate": null,
              "phone": null
            },
            {
              "name": "صيدلية د/ محمود حماد",
              "lat": 31.413052582674702,
              "lng": 31.862487606588566,
              "rate": null,
              "phone": null
            }
          ],
          "supermarket": [
            {
              "name": "رزوق",
              "lat": 31.41106309704364,
              "lng": 31.863526650001297,
              "rate": null,
              "phone": null
            },
            {
              "name": "ناصر",
              "lat": 31.409342809006827,
              "lng": 31.86151098193126,
              "rate": null,
              "phone": null
            }
          ],
          "gym": [
            {
              "name": "فورمه",
              "lat": 31.411598654528067,
              "lng": 31.861422239882117,
              "rate": null,
              "phone": null
            }
          ],
          "clothes": [],
          "bookstore": [
            {
              "name": "كارم الغباشى",
              "lat": 31.410773391099205,
              "lng": 31.868974029196423,
              "rate": null,
              "phone": null
            },
            {
              "name": "مكتبة الامانه /كوكو",
              "lat": 31.410528476040803,
              "lng": 31.869968288846067,
              "rate": null,
              "phone": null
            },
            {
              "name": "مكتبة محمد",
              "lat": 31.412065564847072,
              "lng": 31.86581891996916,
              "rate": null,
              "phone": null
            }
          ],
          "bakery": [
            {
              "name": "baker chife",
              "lat": 31.40956375112161,
              "lng": 31.867188810181776,
              "rate": null,
              "phone": null
            }
          ],
          "hair_salon": [
            {
              "name": "roke",
              "lat": 31.40800353367173,
              "lng": 31.861311747132525,
              "rate": null,
              "phone": null
            },
            {
              "name": "barca",
              "lat": 31.41045404408299,
              "lng": 31.8677487454693,
              "rate": null,
              "phone": null
            }
          ],
          "hotel": []
        }
      }
    }
  }
;